config.org
#+TITLE: Emacs Config
#+AUTHOR: Adwait Adhikari
#+PROPERTY: header-args :tangle post-init.el :results none
#+STARTUP: showeverything
#+OPTIONS: toc:2 ^:{}
#+auto_tangle: t

* Table of Contents :TOC:
- [[#initial-initialization][Initial Initialization]]
  - [[#custom-init-files][Custom init files]]
  - [[#benchmarking][Benchmarking]]
  - [[#custom-vars][Custom Vars]]
  - [[#libraries][Libraries]]
  - [[#exec-path][Exec Path]]
  - [[#elpaca-setup][Elpaca Setup]]
  - [[#system][System]]
  - [[#evil][Evil]]
  - [[#keybinds][Keybinds]]
  - [[#which-key][Which Key]]
  - [[#session-preservation][Session Preservation]]
  - [[#custom-functions][Custom Functions]]
  -  [[#hyprland-integration][Hyprland Integration]]
  - [[#custom-hooks][Custom hooks]]
- [[#applications][Applications]]
  - [[#mason][Mason]]
  - [[#avy][Avy]]
  - [[#browse-url][Browse URL]]
  - [[#calendar][Calendar]]
  - [[#denote][Denote]]
  - [[#dired][Dired]]
  - [[#elfeed][Elfeed]]
  - [[#gptel][Gptel]]
  - [[#helpful][Helpful]]
  - [[#jinx][Jinx]]
  - [[#kindle][Kindle]]
  - [[#misc-utilities][Misc Utilities]]
  - [[#nano-read][Nano Read]]
  - [[#wasabi][Wasabi]]
- [[#buffer-management][Buffer Management]]
  - [[#buffer-alist][Buffer Alist]]
  - [[#buffer-commands][Buffer Commands]]
  - [[#buffer-terminator][Buffer Terminator]]
  - [[#ibuffer][Ibuffer]]
  - [[#workspace][Workspace]]
- [[#styling][Styling]]
  - [[#typography-stack][Typography stack]]
  - [[#scrolling-improvements][Scrolling improvements]]
  - [[#frame--windows-layout--behavior][Frame / windows layout & behavior]]
  - [[#visual-hints][Visual hints]]
  - [[#modeline][Modeline]]
  - [[#themes][Themes]]
- [[#org-mode][Org Mode]]
  - [[#org-agenda][Org Agenda]]
  - [[#better-latex-blocks][Better Latex Blocks]]
  - [[#org-superstar][Org Superstar]]
  - [[#prettify-symbols][Prettify Symbols]]
  - [[#small-utilities][Small Utilities]]
- [[#mini-buffer-completions][Mini-buffer Completions]]
  - [[#consult][Consult]]
  - [[#embark][Embark]]
  - [[#extended-settings][Extended Settings]]
  - [[#marginalia][Marginalia]]
  - [[#orderless][Orderless]]
  - [[#vertico][Vertico]]
- [[#development][Development]]
  - [[#encryption][Encryption]]
  - [[#completions][Completions]]
  - [[#lsp][LSP]]
  - [[#snippets][Snippets]]
  - [[#code-formatting][Code Formatting]]
  - [[#git][Git]]
  - [[#ligatures][Ligatures]]
  - [[#project-management][Project Management]]
  - [[#rainbow-delimeters-prettified-hex-codes--todos][Rainbow Delimeters, Prettified Hex Codes & Todos]]
  - [[#syntax-highlighting][Syntax Highlighting]]
  - [[#indentation][Indentation]]
  - [[#languages][Languages]]
- [[#shells--terminals][Shells & Terminals]]
  - [[#eshell][Eshell]]
  - [[#vterm][Vterm]]
- [[#undo][Undo]]
  - [[#undo-fu][Undo Fu]]
  - [[#vundo][Vundo]]
- [[#benchmarking-1][Benchmarking]]

* Initial Initialization
** Custom init files
Prevent config files from being byte-compiled and to activate lexical binding as required by [[https://github.com/jamescherti/minimal-emacs.d][minimal-emacs.d]].
#+begin_src emacs-lisp :tangle pre-early-init.el

  ;;; pre-early-init.el --- Pre Early Init -*- no-byte-compile: t; lexical-binding: t; -*-

#+end_src

#+begin_src emacs-lisp :tangle post-early-init.el

  ;;; post-early-init.el --- Post Early Init -*- no-byte-compile: t; lexical-binding: t; -*-

#+end_src

#+begin_src emacs-lisp :tangle pre-init.el

  ;;; pre-init.el --- Pre Init -*- no-byte-compile: t; lexical-binding: t; -*-

#+end_src

#+begin_src emacs-lisp

  ;;; post-init.el --- Post Init -*- no-byte-compile: t; lexical-binding: t; -*-

#+end_src

** Benchmarking
#+begin_src emacs-lisp

  (setq init-start-time (current-time))

#+end_src

** Custom Vars
Here we specify certain variables to make referencing and changing them later easier.
#+begin_src emacs-lisp :tangle pre-early-init.el

  (defvar nox/emacs-directory (expand-file-name "~/.config/kairo")
    "Base Emacs directory.")
  (defvar nox/emacs-config-file (expand-file-name "config.org" nox/emacs-directory)
    "Base Emacs config file.")
  (defvar nox/notes-directory (expand-file-name "~/Documents/notes")
    "Base notes directory.")
  (defvar nox/journal-directory (expand-file-name "journal" nox/notes-directory)
    "Base journal directory.")
  (defvar nox/projects-directory (expand-file-name "~/Documents/projects")
    "Base projects directory.")
  (defvar nox/tasks-file (expand-file-name "inbox/tasks.org" nox/notes-directory)
    "Tasks file.")
  (defvar nox/events-file (expand-file-name "inbox/events.org" nox/notes-directory)
    "Events file.")
  (defvar nox/holidays-file (expand-file-name "inbox/holidays.org" nox/notes-directory)
    "Holidays file.")
  (defvar nox/inbox-file (expand-file-name "inbox/inbox.org" nox/notes-directory)
    "Inbox file.")
  (defvar nox/todo-contexts '("@home" "@work" "@shop" "@phone")
    "Tasks contexts.")

  (setq epa-file-encrypt-to "adwait@adhk.dev")

#+end_src

** Libraries
Here we specify the ~libs~ directory to contains other Elisp files that we are about to load. We also specify a custom ~custom-file~ so that Emacs doesn’t mess-up out ~init.el~.
#+begin_src emacs-lisp :tangle pre-early-init.el

  (add-to-list 'load-path (expand-file-name "libs/" nox/emacs-directory))

  (require 'on)          ;; Doom Style Hooks
  (require 'doom-macros) ;; Doom Style Macros
  (require 'link-converter)
  (require 'block-converter)

#+end_src

** Exec Path
#+begin_src emacs-lisp

  (load custom-file 'noerror 'no-message)
  (use-package exec-path-from-shell
    :hook
    (on-first-input . exec-path-from-shell-initialize))

#+end_src

** Elpaca Setup
By default, ~minimal-emacs-package-initialize-and-refresh~ is set to t, which makes minimal-emacs.d call the built-in package manager. Since Elpaca will replace the package manager, there is no need to call it.
#+begin_src emacs-lisp :tangle pre-early-init.el

  (setq minimal-emacs-package-initialize-and-refresh nil)

#+end_src

Here we bootstrap elpaca.
#+begin_src emacs-lisp :tangle pre-init.el

  (defvar elpaca-installer-version 0.11)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil :depth 1 :inherit ignore
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (<= emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                    ,@(when-let* ((depth (plist-get order :depth)))
                                                        (list (format "--depth=%d" depth) "--no-single-branch"))
                                                    ,(plist-get order :repo) ,repo))))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                          "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))

  (elpaca elpaca-use-package
    (elpaca-use-package-mode))

#+end_src

** System
*** Authsources
Update ~authsources~ so that it uses encryption by default. Make sure you have properly setup ~gpg~ keys as well as have a ~keyring~ setup.
#+begin_src emacs-lisp

  (defvar nox/authinfo-file (file-name-concat minimal-emacs-user-directory "authinfo.gpg")
    "Authinfo file")

  (setq auth-sources (list nox/authinfo-file))

#+end_src

*** Ensure all packages by default
Auto add ~:ensure t~ to all use-package.
#+begin_src emacs-lisp :tangle pre-init.el

  (setq use-package-always-ensure t)

#+end_src

*** Frame Title
Set default frame title format.
#+begin_src emacs-lisp :tangle post-early-init.el

  (setq frame-title-format "%b - Kairo Emacs")
  (setq icon-title-format frame-title-format)

#+end_src

*** Package Statistics
Calculates statistics about package declarations.
#+begin_src emacs-lisp :tangle pre-init.el

  ;; use M-x use-package-report
  (setq use-package-compute-statistics t)

#+end_src

*** Sane defaults
Everything that you would typically expect when coming form other IDEs. This also includes some niceties that Emacs provides but not enabled by default.
#+begin_src emacs-lisp

  (use-package emacs
    :ensure nil
    :bind*
    (("C-?" . dictionary-lookup-definition))
    :init
    (pixel-scroll-precision-mode 1)
    ;;(global-hl-line-mode 1)
    (indent-tabs-mode -1)        ;; Disable the use of tabs for indentation.
    (xterm-mouse-mode 1)         ;; Enable mouse support in terminal mode.
    (file-name-shadow-mode 1)    ;; Enable shadowing of filenames for clarity.
    (electric-pair-mode 1)       ;; Enable pair parens.
    (display-battery-mode 1)     ;; Enable displaying battery info in modline.
    (winner-mode 1)              ;; Easily undo window configuration changes.
    (line-number-mode 1)
    (column-number-mode 1)
    :custom
    (dictionary-server "dict.org")        ;; set dictionary server.
    (delete-selection-mode 1)             ;; Replacing selected text with typed text.
    (global-visual-line-mode 1)           ;; Better text wrapping.
    (display-line-numbers-type 'relative) ;; Use relative line numbering.
    (history-length 25)                   ;; Set the length of the command history.
    (ispell-dictionary "en_US")           ;; Default dictionary for spell checking.
    (ring-bell-function 'ignore)          ;; Disable the audible bell.
    (tab-width 4)                         ;; Set the tab width to 4 spaces.
    (use-dialog-box nil)                  ;; Disable dialog boxes.
    (warning-minimum-level :error)        ;; Set the minimum level of warnings.
    (show-paren-context-when-offscreen t) ;; Show context of parens when offscreen.

    ;; TAB key complete, instead of just indenting.
    (tab-always-indent 'complete)
    ;; Use advanced font locking for Treesit mode.
    (treesit-font-lock-level 4)
    ;; Offer to delete any autosave file when killing a buffer.
    (kill-buffer-delete-auto-save-files t)
    :config
    (add-hook! before-save #'delete-trailing-whitespace)
    (add-hook! after-save  #'executable-make-buffer-file-executable-if-script-p)
    (set-default-coding-systems 'utf-8)
    (setq-default select-enable-clipboard t
                  indent-tabs-mode nil))

#+end_src

