post-init.el
;;; post-init.el --- Post Init -*- no-byte-compile: t; lexical-binding: t; -*-

(setq init-start-time (current-time))

(load custom-file 'noerror 'no-message)

(use-package exec-path-from-shell
  :hook
  (on-first-input . exec-path-from-shell-initialize))

(defvar nox/authinfo-file (file-name-concat minimal-emacs-user-directory "authinfo.gpg")
  "Authinfo file")

(setq auth-sources (list nox/authinfo-file))

(use-package emacs
  :ensure nil
  :bind*
  (("C-?" . dictionary-lookup-definition))
  :init
  (pixel-scroll-precision-mode 1)
  ;;(global-hl-line-mode 1)
  (indent-tabs-mode -1)        ;; Disable the use of tabs for indentation.
  (xterm-mouse-mode 1)         ;; Enable mouse support in terminal mode.
  (file-name-shadow-mode 1)    ;; Enable shadowing of filenames for clarity.
  (electric-pair-mode 1)       ;; Enable pair parens.
  (display-battery-mode 1)     ;; Enable displaying battery info in modline.
  (winner-mode 1)              ;; Easily undo window configuration changes.
  (line-number-mode 1)
  (column-number-mode 1)
  :custom
  (dictionary-server "dict.org")        ;; set dictionary server.
  (delete-selection-mode 1)             ;; Replacing selected text with typed text.
  (global-visual-line-mode 1)           ;; Better text wrapping.
  (display-line-numbers-type 'relative) ;; Use relative line numbering.
  (history-length 25)                   ;; Set the length of the command history.
  (ispell-dictionary "en_US")           ;; Default dictionary for spell checking.
  (ring-bell-function 'ignore)          ;; Disable the audible bell.
  (tab-width 4)                         ;; Set the tab width to 4 spaces.
  (use-dialog-box nil)                  ;; Disable dialog boxes.
  (warning-minimum-level :error)        ;; Set the minimum level of warnings.
  (show-paren-context-when-offscreen t) ;; Show context of parens when offscreen.

  ;; TAB key complete, instead of just indenting.
  (tab-always-indent 'complete)
  ;; Use advanced font locking for Treesit mode.
  (treesit-font-lock-level 4)
  ;; Offer to delete any autosave file when killing a buffer.
  (kill-buffer-delete-auto-save-files t)
  :config
  (add-hook! before-save #'delete-trailing-whitespace)
  (add-hook! after-save  #'executable-make-buffer-file-executable-if-script-p)
  (set-default-coding-systems 'utf-8)
  (setq-default select-enable-clipboard t
                indent-tabs-mode nil))
