config.org
*** Server Mode
Configure the built-in Emacs server to start after initialization, allowing the use of the ~emacsclient~ command to open files in the current session.
#+begin_src emacs-lisp

  (use-package server
    :ensure nil
    :hook (elpaca-after-init . server-start))

  (defun nox/quit-emacs-server ()
    "Save buffers and kill Emacs server."
    (interactive)
    (save-some-buffers t)
    (kill-emacs))

#+end_src

** Evil
[[https://github.com/emacs-evil/evil][Evil mode]], emulating vim key-binds inside Emacs. *Truly Evil!* Here we also change the undo system to utilize [[#undo-fu][undo fu]].
#+begin_src emacs-lisp

  (use-package evil
    :hook
    (on-first-input . evil-mode)
    :init
    ;; It has to be defined before evil
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    :custom
    (evil-undo-system 'undo-fu)
    ;; C-u behaves like it does in vim
    (evil-want-C-u-scroll t)
    ;; Make :s in visual mode operate only on the actual visual selection
    ;; (character or block), instead of the full lines covered by the selection
    (evil-ex-visual-char-range t)
    ;; Use Vim-style regular expressions in search and substitute commands,
    ;; allowing features like \v (very magic), \zs, and \ze for precise matches
    (evil-ex-search-vim-style-regexp t)
    ;; Enable automatic vertical split to the right
    (evil-vsplit-window-right t)
    ;; Disable echoing Evil state to avoid replacing eldoc
    (evil-echo-state nil)
    ;; Do not move cursor back when exiting insert state
    (evil-move-cursor-back nil)
    ;; Make `v$` exclude the final newline
    (evil-v$-excludes-newline t)
    ;; Allow C-h to delete in insert state
    (evil-want-C-h-delete t)
    ;; Enable C-u to delete back to indentation in insert state
    (evil-want-C-u-delete t)
    ;; Enable fine-grained undo behavior
    (evil-want-fine-undo t)
    ;; Whether Y yanks to the end of the line
    (evil-want-Y-yank-to-eol t)
    :config
    (evil-mode)

    (evil-define-key 'normal 'global
      (kbd "C-S-v") 'cua-set-mark
      (kbd "C-\\")  'window-toggle-side-windows
      (kbd "C-M-u") 'vundo
      "j" 'evil-next-visual-line
      "k" 'evil-previous-visual-line
      "s" 'evil-avy-goto-char-timer)

    (evil-define-key '(normal visual) 'global
      "P" 'consult-yank-from-kill-ring
      "H" 'evil-first-non-blank
      "L" 'evil-end-of-line))

#+end_src

We are also installing evil-collection so that we have sane evil bindings in almost all modes.
#+begin_src emacs-lisp

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init)
    :custom
    (evil-collection-calendar-want-org-bindings t)
    (evil-collection-want-find-usages-bindings t))

#+end_src

[[https://github.com/Somelauw/evil-org-mode][Evil Org]] is a plugin for Emacs that integrates Evil with Org Mode, allowing for modal editing features from Evil to be used within Org documents, enhancing text editing and navigation capabilities.
#+begin_src emacs-lisp

  (use-package evil-org
    :hook (org-mode . evil-org-mode)
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))

#+end_src

