post-init.el

(use-package server
  :ensure nil
  :hook (elpaca-after-init . server-start))

(defun nox/quit-emacs-server ()
  "Save buffers and kill Emacs server."
  (interactive)
  (save-some-buffers t)
  (kill-emacs))

(use-package evil
  :hook
  (on-first-input . evil-mode)
  :init
  ;; It has to be defined before evil
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  :custom
  (evil-undo-system 'undo-fu)
  ;; C-u behaves like it does in vim
  (evil-want-C-u-scroll t)
  ;; Make :s in visual mode operate only on the actual visual selection
  ;; (character or block), instead of the full lines covered by the selection
  (evil-ex-visual-char-range t)
  ;; Use Vim-style regular expressions in search and substitute commands,
  ;; allowing features like \v (very magic), \zs, and \ze for precise matches
  (evil-ex-search-vim-style-regexp t)
  ;; Enable automatic vertical split to the right
  (evil-vsplit-window-right t)
  ;; Disable echoing Evil state to avoid replacing eldoc
  (evil-echo-state nil)
  ;; Do not move cursor back when exiting insert state
  (evil-move-cursor-back nil)
  ;; Make `v$` exclude the final newline
  (evil-v$-excludes-newline t)
  ;; Allow C-h to delete in insert state
  (evil-want-C-h-delete t)
  ;; Enable C-u to delete back to indentation in insert state
  (evil-want-C-u-delete t)
  ;; Enable fine-grained undo behavior
  (evil-want-fine-undo t)
  ;; Whether Y yanks to the end of the line
  (evil-want-Y-yank-to-eol t)
  :config
  (evil-mode)

  (evil-define-key 'normal 'global
    (kbd "C-S-v") 'cua-set-mark
    (kbd "C-\\")  'window-toggle-side-windows
    (kbd "C-M-u") 'vundo
    "j" 'evil-next-visual-line
    "k" 'evil-previous-visual-line
    "s" 'evil-avy-goto-char-timer)

  (evil-define-key '(normal visual) 'global
    "P" 'consult-yank-from-kill-ring
    "H" 'evil-first-non-blank
    "L" 'evil-end-of-line))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init)
  :custom
  (evil-collection-calendar-want-org-bindings t)
  (evil-collection-want-find-usages-bindings t))

(use-package evil-org
  :hook (org-mode . evil-org-mode)
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))
