config.org
** Keybinds
[[https://github.com/noctuid/general.el][General]] helps set key-binds for Emacs. The following contains all the rest of key-binds that don't directly relate to evil binds. Here we also set =SPC= as the prefix key and =C-SPC= as global prefix. Global prefix basically means prefix key but in every single state.
#+begin_src emacs-lisp

  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  (use-package general
    :config
    (general-evil-setup)

    (general-create-definer nox/leader-keys
      :states  '(normal insert visual emacs)
      :keymaps 'override
      :prefix "SPC"
      :global-prefix "C-SPC")

    (general-create-definer nox/prog-keys
      :states  '(normal insert visual emacs)
      :keymaps 'prog-mode-map
      :prefix "SPC"
      :global-prefix "C-SPC")

    (general-create-definer nox/org-keys
      :states  '(normal insert visual emacs)
      :keymaps 'org-mode-map
      :prefix "SPC"
      :global-prefix "C-SPC")

#+end_src

#+begin_src emacs-lisp

  (nox/leader-keys
    "a"   '(:ignore t :wk "[A]pplications")
    "a c" '(calendar :wk "[C]alendar")
    "a e" '(=elfeed :wk "[E]lfeed")
    "a g" '(gptel :wk "[G]ptel")
    "a m" '(mu4e :wk "[M]ail"))

#+end_src

#+begin_src emacs-lisp

  (nox/leader-keys
    "b"   '(:ignore t :wk "[B]uffer")
    "b b" '(consult-buffer :wk "[B]uffer Switch")
    "b i" '(persp-ibuffer :wk "[I]buffer")
    "b k" '(kill-current-buffer :wk "[K]ill Buffer")
    "b n" '(next-buffer :wk "[N]ext Buffer")
    "b p" '(previous-buffer :wk "[P]revious Buffer")
    "b r" '(revert-buffer :wk "[R]eload Buffer"))

#+end_src

#+begin_src emacs-lisp

  (nox/prog-keys
    "c"   '(:ignore t :wk "[C]ode")
    "c a" '(eglot-code-actions :wk "Code actions")
    "c r" '(eglot-rename :wk "Eglot rename")
    "c e" '(flycheck-list-errors :wk "List errors")
    "c f" '(consult-flymake :wk "Consult [F]lymake")
    "c n" '(flymake-goto-next-error :wk "[N]ext flymake error")
    "c p" '(flymake-goto-prev-error :wk "[P]revious flymake error")

    "c d"   '(:ignore t :wk "[D]irenv")
    "c d a" '(envrc-allow :wk "[A]llow environment")
    "c d r" '(envrc-reload :wk "[R]eload environment"))

#+end_src

#+begin_src emacs-lisp

  (nox/leader-keys
    "d"   '(:ignore t :wk "[D]ired")
    "d ." '(dired-omit-mode :wk "Toggle dot files")
    "d d" '(dirvish :wk "[D]irvish")
    "d h" '(dired-hide-details-mode :wk "[D]ired"))

#+end_src

#+begin_src emacs-lisp

  (nox/leader-keys
    "e"   '(:ignore t :wk "[E]val")
    "e b" '(eval-buffer :wk "[B]uffer Eval")
    "e d" '(eros-eval-defun :wk "[D]efun Eval")
    "e e" '(eval-expression :wk "[E]xpression Eval")
    "e l" '(eros-eval-last-sexp :wk "[E]xpression Before Eval")
    "e r" '(eval-region :wk "[R]egion Eval"))

#+end_src

#+begin_src emacs-lisp

  (nox/leader-keys
    "f"   '(:ignore t :wk "[F]ile")
    "f c" `((lambda () (interactive) (find-file nox/emacs-config-file)) :wk "[C]onfig File")
    "f s" '(save-buffer :wk "[S]ave Buffer")
    "f b" '(bookmark-set :wk "[B]ookmark Set")
    "f d" '(bufferfile-delete :wk "[D]elete File")
    "f r" '(bufferfile-rename :wk "[R]ename File")
    "f u" '(sudo-edit-find-file :wk "S[U]do Find File")
    "f U" '(sudo-edit :wk "S[U]do Edit File"))

#+end_src

#+begin_src emacs-lisp

  (nox/leader-keys
    "g"   '(:ignore t :wk "[G]it")
    "g g" '(magit-status :wk "[G]it status")
    "g c" '(magit-commit-create :wk "[G]it commit")
    "g n" '(diff-hl-next-hunk :wk "[N]ext hunk")
    "g u" '(diff-hl-revert-hunk :wk "[U]ndo hunk")
    "g p" '(diff-hl-previous-hunk :wk "[P]revious hunk")
    "g s" '(diff-hl-stage-dwim :wk "[S]tage hunk")
    "g P" '(magit-push :wk "[P]ush repo")
    "g S" '(consult-gh-search-repos :wk "[S]earch repos")
    "g D" '(consult-gh-repo-delete :wk "[D]elete repo")
    "g C" '(consult-gh-repo-create :wk "[C]reate repo"))

#+end_src

#+begin_src emacs-lisp

  (nox/leader-keys
    "o"   '(:ignore t :wk "[O]rg")
    "o a" '(org-agenda :wk "[A]genda")
    "o c" '(org-capture :wk "[C]apture")
    "o i" `((lambda () (interactive) (find-file nox/inbox-file)) :wk "[I]nbox")
    "o x" '(org-toggle-checkbox :wk "[C]heckbox")
    "o t" '(nox/capture-todo :wk "[T]odo Capture")
    "o j" '(nox/capture-journal :wk "[J]ournal Capture"))

#+end_src

#+begin_src emacs-lisp

  (nox/leader-keys
    "o k"   '(:ignore t :wk "[K]indle")
    "o k ]" '(nox/kindle-next-page :wk "Next page")
    "o k [" '(nox/kindle-prev-page :wk "Previous page")
    "o k f" '(nox/kindle-first-page :wk "[F]irst page")
    "o k n" '(nox/kindle-next-bookmark :wk "[N]ext bookmark")
    "o k p" '(nox/kindle-prev-bookmark :wk "[P]revious bookmark"))

#+end_src

#+begin_src emacs-lisp

  (nox/leader-keys
    "o l"   '(:ignore t :wk "[L]ink")
    "o l a" '(org-transclusion-add-all :wk "[A]dd transclusions")
    "o l r" '(org-transclusion-remove-all :wk "[R]emove transclusions")
    "o l o" '(org-transclusion-open-source :wk "[O]pen transclusion")
    "o l A" '(org-transclusion-make-from-link :wk "[A]dd link transclusion")
    "o l s" '(org-store-link :wk "[S]tore link"))

#+end_src

#+begin_src emacs-lisp

  (nox/leader-keys
    "o b" '(:ignore t :wk "[B]abel")
    "o b t" '(org-babel-tangle :wk "[T]angle")
    "o b e" '(org-edit-src-code :wk "[E]dit src code")
    "o b d" '(org-babel-demarcate-block :wk "[D]emarcate Block"))

#+end_src

#+begin_src emacs-lisp

  (nox/leader-keys
    "o n"   '(:ignore t :wk "[N]otes")
    "o n f" '(nox/denote-search :wk "[F]ind note")
    "o n r" '(denote-explore-random-note :wk "[R]andom note")
    "o n i" '(denote-explore-isolated-files :wk "[I]solated notes")
    "o n R" '(denote-rename-file :wk "[R]ename note")
    "o n m" '(denote-hide-metadata-mode :wk "[M]etadata toggle")
    "o n l" '(denote-link-or-create :wk "[L]ink note")
    "o n b" '(denote-backlinks :wk "[B]acklinks")
    "o n j" '(denote-journal-new-or-existing-entry :wk "[J]ournal"))

  (nox/org-keys
   "o n i" '(nox/org-dblock-insert-inbox-notes :wk "[I]nbox notes"))

#+end_src

#+begin_src emacs-lisp

  (nox/leader-keys
    "q"   '(:ignore t :wk "[Q]uit")
    "q f" '(delete-frame :wk "[F]rame delete")
    "q r" '(nox/restore-perspectives :wk "[R]estore perspectives")
    "q K" '(kill-emacs :wk "[K]ill emacs"))

#+end_src

#+begin_src emacs-lisp

  (nox/leader-keys
    "p"   '(:ignore t :wk "[P]roject")
    "SPC" '(consult-projectile :wk "Find file in project")
    "p r" '(projectile-remove-known-project :wk "[R]emove Project")
    "p c" '(projectile-compile-project :wk "[C]ompile Project")
    "p s" '(+switch-or-make-project :wk "[S]witch Project"))

#+end_src

#+begin_src emacs-lisp

  (defun nox/reload-config()
    "Reload Emacs config"
    (interactive)
    (load-file (expand-file-name "post-init.el" nox/emacs-directory)))

  (nox/leader-keys
    "r" '(:ignore t :wk "[R]eload & Packages")
    ;; Mason.el
    "r m" '(mason-manager :wk "Mason manager")
    "r i" '(mason-install :wk "Mason install")
    ;; Package-menu-mode
    "r t" '(elpaca-try :wk "[T]ry package")
    "r n" '(elpaca-info :wk "[N]amed package filter")
    "r u" '(elpaca-pull-all :wk "[U]pgrade packages")

    "r r" '(nox/reload-config :wk "[R]eload config"))

#+end_src

#+begin_src emacs-lisp

  (nox/leader-keys
    "s"   '(:ignore t :wk "[S]earch")
    "s g" '(consult-ripgrep :wk "[G]rep in dir")
    "s i" '(consult-imenu :wk "[I]menu")
    "s f" '(consult-fd :wk "[F]d Consult")
    "s r" '(consult-recent-file :wk "[R]recent File")
    "s m" '(bookmark-jump :wk "[M]arks")
    "s c" '(consult-mode-command :wk "[C]ommands for mode"))

#+end_src

#+begin_src emacs-lisp

  (nox/leader-keys
    "t"   '(:ignore t :wk "[T]oggle")
    "t e" '(eshell :wk "[E]shell")
    "t t" '(toggle-theme :wk "[T]oggle theme")
    "t l" '(elpaca-log :wk "[L]og Elpaca")
    "t h" '(hl-line-mode :wk "[H]ighlight Line")
    "t c" '(olivetti-mode :wk "[C]olumn Fill Mode")
    "t d" '(toggle-window-dedicated :wk "[D]edicated Mode")
    "t v" '(vterm :wk "[V]term")
    "t n" '(display-line-numbers-mode :wk "[N]umbered Lines"))

#+end_src

#+begin_src emacs-lisp

  (nox/leader-keys
    "TAB"   '(:ignore t :wk "Workspaces")
    "TAB TAB" '(+list-workspaces :wk "List Workspaces")
    "TAB [" '(persp-prev :wk "Previous Workspace")
    "TAB ]" '(persp-next :wk "Next Workspace")
    "TAB d" '((lambda () (interactive) (persp-kill (persp-name (persp-curr)))) :wk "Delete workspace")
    "TAB m" '((lambda () (interactive) (pop-to-buffer "*Messages*")) :wk "Messages buffer")
    "TAB w" '((lambda () (interactive) (pop-to-buffer "*Warnings*")) :wk "Warnings buffer")
    "TAB n" '(persp-switch :wk "New Workspace"))

#+end_src

#+begin_src emacs-lisp

  (nox/leader-keys
    "RET" '(consult-bookmark :wk "Jump to Bookmark")
    "'" '(vertico-repeat :wk "Resume last search")
    "," '(consult-buffer :wk "Switch buffer")
    "." '(find-file :wk "Find File")))

#+end_src

