config.org
** Which Key
[[https://github.com/justbur/emacs-which-key][Whichkey]] helps showcase the available bindings. Not much to talk about it, it is a nice to have to discover new bindings or to quickly see what the bindings do. Whichkey comes built in to emacs starting =v30=.
#+begin_src emacs-lisp

  (use-package which-key
    :ensure nil
    :hook (on-first-input . which-key-mode)
    :custom
    (which-key-side-window-location 'bottom)
    (which-key-sort-order #'which-key-key-order-alpha)
    (which-key-sort-uppercase-first nil)
    (which-key-add-column-padding 1)
    (which-key-max-display-columns nil)
    (which-key-min-display-lines 5)
    (which-key-side-window-slot -10)
    (which-key-side-window-max-height 0.25)
    (which-key-idle-delay 0.3)
    (which-key-max-description-length 25)
    (which-key-allow-imprecise-window-fit nil)
    (which-key-separator " → " ))

#+end_src

** Session Preservation
*** Auto Save
Enable auto-saves of file related buffers conditionally (timeout/keystrokes).
#+begin_src emacs-lisp

  (setq auto-save-default t     ; auto-save every buffer that visits a file
        auto-save-timeout 20    ; number of seconds idle time before auto-save
        auto-save-interval 200) ; number of keystrokes between auto-saves

  (setq auto-save-list-file-prefix
        (expand-file-name "autosave/" user-emacs-directory))
  (setq tramp-auto-save-directory
        (expand-file-name "tramp-autosave/" user-emacs-directory))

  (setq auto-save-visited-interval 5) ; Save after 5 seconds if inactivity
  (auto-save-visited-mode 1)

#+end_src

*** Auto revert
Auto-revert in Emacs is a feature that automatically updates the contents of a buffer to reflect changes made to the underlying file on disk.
#+begin_src emacs-lisp
  (use-package autorevert
    :ensure nil
    :commands (auto-revert-mode global-auto-revert-mode)
    :hook
    (on-first-input . global-auto-revert-mode)
    :custom
    (auto-revert-interval 3)
    (auto-revert-remote-files nil)
    (auto-revert-use-notify t)
    (auto-revert-avoid-polling nil)
    (auto-revert-verbose t))
#+end_src

*** Backups
Here we are setting up the backup directory as well as making backups version controlled. Its not git version control, but a special Emacs way of keeping multiple backups of a file. We also enable auto saving of buffers.
#+begin_src emacs-lisp

  ;; setting the backup dir to trash.
  (let ((trash-dir (getenv "XDG_DATA_HOME")))
    (unless (and trash-dir (file-directory-p trash-dir))
      (setq trash-dir (expand-file-name "~/.local/share"))) ;; default fallback
    (setq backup-directory-alist `(("." . ,(expand-file-name "Trash/files" trash-dir)))))

  (setq make-backup-files t     ; backup of a file the first time it is saved.
        backup-by-copying t     ; don't clobber symlinks
        version-control   t     ; version numbers for backup files
        delete-old-versions t   ; delete excess backup files silently
        kept-old-versions 6     ; oldest versions to keep when a new numbered
        kept-new-versions 9)    ; newest versions to keep when a new numbered

#+end_src

*** Recentf
Recentf is an Emacs package that maintains a list of recently accessed files, making it easier to reopen files you have worked on recently.
#+begin_src emacs-lisp

  (use-package recentf
    :ensure nil
    :commands (recentf-mode recentf-cleanup)
    :hook
    (on-first-input . recentf-mode)
    :custom
    (recentf-max-menu-items 25)
    (recentf-max-saved-items 300) ; default is 20
    (recentf-auto-cleanup (if (daemonp) 300 'never))
    (recentf-exclude
     (list "\\.tar$" "\\.tbz2$" "\\.tbz$" "\\.tgz$" "\\.bz2$"
           "\\.bz$" "\\.gz$" "\\.gzip$" "\\.xz$" "\\.zip$"
           "\\.7z$" "\\.rar$"
           "COMMIT_EDITMSG\\'"
           "\\.\\(?:gz\\|gif\\|svg\\|png\\|jpe?g\\|bmp\\|xpm\\)$"
           "-autoloads\\.el$" "autoload\\.el$"))
    :config
    (run-with-timer (* 30 60) (* 30 60) 'recentf-save-list)
    ;; A cleanup depth of -90 ensures that `recentf-cleanup' runs before
    ;; `recentf-save-list', allowing stale entries to be removed before the list
    ;; is saved by `recentf-save-list', which is automatically added to
    ;; `kill-emacs-hook' by `recentf-mode'.
    (add-hook! kill-emacs :depth -90 #'recentf-cleanup))

#+end_src

*** Savehist
savehist is an Emacs feature that preserves the minibuffer history between sessions. It saves the history of inputs in the minibuffer, such as commands, search strings, and other prompts, to a file. This allows users to retain their minibuffer history across Emacs restarts.
#+begin_src emacs-lisp

  (use-package savehist
    :ensure nil
    :commands (savehist-mode savehist-save)
    :hook
    (on-first-input . savehist-mode)
    :custom
    (savehist-autosave-interval 600)
    (savehist-additional-variables
     '(kill-ring                     ; clipboard
       register-alist                   ; macros
       mark-ring global-mark-ring       ; marks
       search-ring
       regexp-search-ring
       command-history
       set-variable-value-history
       custom-variable-history
       query-replace-history
       read-expression-history
       minibuffer-history
       read-char-history
       face-name-history
       bookmark-history
       file-name-history)))

#+end_src

We remove text properties for kill ring entries so that the save-hist file doesn't get way too large. A large save-hist file slows down Emacs considerably. =substring-no-properties= removes any text properties from a given string. =kill-ring= is a list of strings; we're using =mapcar= to apply =substring-no-properties= to each string that is currently in the kill ring. The result of the =mapcar call= (i.e. a list of strings without any text properties) is used to override the original value of =kill-ring=. [[https://emacs.stackexchange.com/questions/4187/strip-text-properties-in-savehist][Source]]
#+begin_src emacs-lisp

  (defun unpropertize-kill-ring ()
    (setq kill-ring (mapcar 'substring-no-properties kill-ring)))
  (add-hook! kill-emacs #'unpropertize-kill-ring)

#+end_src

*** Save Place
save-place-mode enables Emacs to remember the last location within a file upon reopening. This feature is particularly beneficial for resuming work at the precise point where you previously left off.
#+begin_src emacs-lisp

  (use-package saveplace
    :ensure nil
    :commands (save-place-mode save-place-local-mode)
    :hook
    (on-first-file . save-place-mode)
    :custom
    (save-place-limit 400))

#+end_src

** Custom Functions
#+begin_src emacs-lisp

  (defun nox/get-secret (path)
    "Retrieve a specific secret using yq from the decrypted SOPS file."
    (string-trim
     (shell-command-to-string
      (format "sops -d %s | yq -r '%s'"
              (shell-quote-argument
               (expand-file-name "~/Documents/projects/ember/secrets/secrets.sops.yaml"))
              path))))

#+end_src

#+begin_src emacs-lisp

  (defun nox/open-todays-agenda ()
    "Open today's Org agenda in a dedicated floating frame."
    (interactive)
    ;; Create a new frame with a name and class
    (let ((frame (make-frame '((name . "agenda")))))
      (select-frame-set-input-focus frame)
      ;; Open agenda for today
      (org-agenda nil "a")
      ;; Delete other windows to show only agenda buffer
      (delete-other-windows)
      (set-window-dedicated-p (selected-window) t)))

#+end_src

#+begin_src emacs-lisp

  (defun nox/move-up-and-center ()
    "Move up and center."
    (interactive)
    (evil-previous-visual-line)
    (recenter))

  (defun nox/move-down-and-center ()
    "Move down and center."
    (interactive)
    (evil-next-visual-line)
    (recenter))

#+end_src

[[https://xenodium.com/emacs-dwim-do-what-i-mean][Emacs DWIM: do what ✨I✨ mean]]
#+begin_src emacs-lisp
  (defun ar/org-insert-link-dwim ()
    "Like `org-insert-link' but with personal dwim preferences."
    (interactive)
    (let* ((point-in-link (org-in-regexp org-link-any-re 1))
           (clipboard-url (when (string-match-p "^http" (current-kill 0))
                            (current-kill 0)))
           (region-content (when (region-active-p)
                             (buffer-substring-no-properties (region-beginning)
                                                             (region-end)))))
      (cond ((and region-content clipboard-url (not point-in-link))
             (delete-region (region-beginning) (region-end))
             (insert (org-make-link-string clipboard-url region-content)))
            ((and clipboard-url (not point-in-link))
             (insert (org-make-link-string
                      clipboard-url
                      (read-string "title: "
                                   (with-current-buffer (url-retrieve-synchronously clipboard-url)
                                     (dom-text (car
                                                (dom-by-tag (libxml-parse-html-region
                                                             (point-min)
                                                             (point-max))
                                                            'title))))))))
            (t
             (call-interactively 'org-insert-link)))))

#+end_src

