post-init.el

(use-package which-key
  :ensure nil
  :hook (on-first-input . which-key-mode)
  :custom
  (which-key-side-window-location 'bottom)
  (which-key-sort-order #'which-key-key-order-alpha)
  (which-key-sort-uppercase-first nil)
  (which-key-add-column-padding 1)
  (which-key-max-display-columns nil)
  (which-key-min-display-lines 5)
  (which-key-side-window-slot -10)
  (which-key-side-window-max-height 0.25)
  (which-key-idle-delay 0.3)
  (which-key-max-description-length 25)
  (which-key-allow-imprecise-window-fit nil)
  (which-key-separator " → " ))

(setq auto-save-default t     ; auto-save every buffer that visits a file
      auto-save-timeout 20    ; number of seconds idle time before auto-save
      auto-save-interval 200) ; number of keystrokes between auto-saves

(setq auto-save-list-file-prefix
      (expand-file-name "autosave/" user-emacs-directory))
(setq tramp-auto-save-directory
      (expand-file-name "tramp-autosave/" user-emacs-directory))

(setq auto-save-visited-interval 5) ; Save after 5 seconds if inactivity
(auto-save-visited-mode 1)

(use-package autorevert
  :ensure nil
  :commands (auto-revert-mode global-auto-revert-mode)
  :hook
  (on-first-input . global-auto-revert-mode)
  :custom
  (auto-revert-interval 3)
  (auto-revert-remote-files nil)
  (auto-revert-use-notify t)
  (auto-revert-avoid-polling nil)
  (auto-revert-verbose t))

;; setting the backup dir to trash.
(let ((trash-dir (getenv "XDG_DATA_HOME")))
  (unless (and trash-dir (file-directory-p trash-dir))
    (setq trash-dir (expand-file-name "~/.local/share"))) ;; default fallback
  (setq backup-directory-alist `(("." . ,(expand-file-name "Trash/files" trash-dir)))))

(setq make-backup-files t     ; backup of a file the first time it is saved.
      backup-by-copying t     ; don't clobber symlinks
      version-control   t     ; version numbers for backup files
      delete-old-versions t   ; delete excess backup files silently
      kept-old-versions 6     ; oldest versions to keep when a new numbered
      kept-new-versions 9)    ; newest versions to keep when a new numbered

(use-package recentf
  :ensure nil
  :commands (recentf-mode recentf-cleanup)
  :hook
  (on-first-input . recentf-mode)
  :custom
  (recentf-max-menu-items 25)
  (recentf-max-saved-items 300) ; default is 20
  (recentf-auto-cleanup (if (daemonp) 300 'never))
  (recentf-exclude
   (list "\\.tar$" "\\.tbz2$" "\\.tbz$" "\\.tgz$" "\\.bz2$"
         "\\.bz$" "\\.gz$" "\\.gzip$" "\\.xz$" "\\.zip$"
         "\\.7z$" "\\.rar$"
         "COMMIT_EDITMSG\\'"
         "\\.\\(?:gz\\|gif\\|svg\\|png\\|jpe?g\\|bmp\\|xpm\\)$"
         "-autoloads\\.el$" "autoload\\.el$"))
  :config
  (run-with-timer (* 30 60) (* 30 60) 'recentf-save-list)
  ;; A cleanup depth of -90 ensures that `recentf-cleanup' runs before
  ;; `recentf-save-list', allowing stale entries to be removed before the list
  ;; is saved by `recentf-save-list', which is automatically added to
  ;; `kill-emacs-hook' by `recentf-mode'.
  (add-hook! kill-emacs :depth -90 #'recentf-cleanup))

(use-package savehist
  :ensure nil
  :commands (savehist-mode savehist-save)
  :hook
  (on-first-input . savehist-mode)
  :custom
  (savehist-autosave-interval 600)
  (savehist-additional-variables
   '(kill-ring                     ; clipboard
     register-alist                   ; macros
     mark-ring global-mark-ring       ; marks
     search-ring
     regexp-search-ring
     command-history
     set-variable-value-history
     custom-variable-history
     query-replace-history
     read-expression-history
     minibuffer-history
     read-char-history
     face-name-history
     bookmark-history
     file-name-history)))

(defun unpropertize-kill-ring ()
  (setq kill-ring (mapcar 'substring-no-properties kill-ring)))
(add-hook! kill-emacs #'unpropertize-kill-ring)

(use-package saveplace
  :ensure nil
  :commands (save-place-mode save-place-local-mode)
  :hook
  (on-first-file . save-place-mode)
  :custom
  (save-place-limit 400))

(defun nox/get-secret (path)
  "Retrieve a specific secret using yq from the decrypted SOPS file."
  (string-trim
   (shell-command-to-string
    (format "sops -d %s | yq -r '%s'"
            (shell-quote-argument
             (expand-file-name "~/Documents/projects/ember/secrets/secrets.sops.yaml"))
            path))))

(defun nox/open-todays-agenda ()
  "Open today's Org agenda in a dedicated floating frame."
  (interactive)
  ;; Create a new frame with a name and class
  (let ((frame (make-frame '((name . "agenda")))))
    (select-frame-set-input-focus frame)
    ;; Open agenda for today
    (org-agenda nil "a")
    ;; Delete other windows to show only agenda buffer
    (delete-other-windows)
    (set-window-dedicated-p (selected-window) t)))

(defun nox/move-up-and-center ()
  "Move up and center."
  (interactive)
  (evil-previous-visual-line)
  (recenter))

(defun nox/move-down-and-center ()
  "Move down and center."
  (interactive)
  (evil-next-visual-line)
  (recenter))

(defun ar/org-insert-link-dwim ()
  "Like `org-insert-link' but with personal dwim preferences."
  (interactive)
  (let* ((point-in-link (org-in-regexp org-link-any-re 1))
         (clipboard-url (when (string-match-p "^http" (current-kill 0))
                          (current-kill 0)))
         (region-content (when (region-active-p)
                           (buffer-substring-no-properties (region-beginning)
                                                           (region-end)))))
    (cond ((and region-content clipboard-url (not point-in-link))
           (delete-region (region-beginning) (region-end))
           (insert (org-make-link-string clipboard-url region-content)))
          ((and clipboard-url (not point-in-link))
           (insert (org-make-link-string
                    clipboard-url
                    (read-string "title: "
                                 (with-current-buffer (url-retrieve-synchronously clipboard-url)
                                   (dom-text (car
                                              (dom-by-tag (libxml-parse-html-region
                                                           (point-min)
                                                           (point-max))
                                                          'title))))))))
          (t
           (call-interactively 'org-insert-link)))))
