config.org
**  Hyprland Integration
Make navigating in between emacs windows as well as hyprland windows easier by using the same keybinds.
#+begin_src emacs-lisp

  (defvar hyprland-directions-alist
    '(("l" . left)
      ("r" . right)
      ("u" . up)
      ("d" . down)))

  (defmacro hyprctl (&rest args)
    `(start-process "emacs-hyprland-integration" nil "hyprctl" "dispatch" ,@args))

  (use-package windmove
    :ensure nil
    :autoload windmove-find-other-window)

  (defun nox/emacs-hyprland-integration (dir)
    "Move focus in Emacs or Hyprland depending on DIR."
    ;; Assign windmove-dir to correct windmove direction format
    (let ((windmove-dir (cdr (assoc dir hyprland-directions-alist)))
          (other-window nil))
      (setq other-window (windmove-find-other-window windmove-dir))
      (if (or (null other-window) (window-minibuffer-p other-window))
          (hyprctl "movefocus" dir)
        (windmove-do-window-select windmove-dir))))

#+end_src

** Custom hooks
Created a custom hook which helps changing colors when theme changes.
#+begin_src emacs-lisp

  (defvar nox/after-theme-change-hook nil
    "Hook run after a theme is changed.")

  (defun nox/run-after-theme-change-hook (&rest _)
    "Run `nox/after-theme-change-hook` after theme change."
    (run-hooks 'nox/after-theme-change-hook))

  ;; run `nox/after-theme-change-hook' after load-theme
  (advice-add 'load-theme :after #'nox/run-after-theme-change-hook)

#+end_src

* Applications
** Mason
#+begin_src emacs-lisp

  (use-package mason
    :hook (on-first-file . mason-ensure))

  (defun nox/mason-ensure (arg &optional packages)
    "Ensure PACKAGES are installed via Mason.
  If ARG is a symbol (mode), add a Doom-style hook for it.
  If ARG is a list (packages), install immediately."
    (if (symbolp arg)
        ;; ARG is a mode
        (when packages
          (add-hook! arg
            (dolist (pkg packages)
              (unless (mason-installed-p pkg)
                (ignore-errors
                  (mason-install pkg))))))
      ;; ARG is actually the packages list, install now
      (let ((pkgs arg))
        (dolist (pkg pkgs)
          (unless (mason-installed-p pkg)
            (ignore-errors
              (mason-install pkg)))))))

#+end_src
** Avy
Jumping around in text has never been easier! Use the =s= key in normal mode to see what [[https://github.com/abo-abo/avy][avy]] is capable of. Here we also change the default text face when avy is activated to make it easier to see the jump places.
#+begin_src emacs-lisp

  (use-package avy
    :commands
    (evil-avy-goto-char-timer
     nox/avy-jump-org-block
     nox/avy-jump-to-link)
    :custom
    (avy-background t)
    :config
    (set-face-attribute 'avy-background-face nil
                        :foreground 'unspecified
                        :background 'unspecified
                        :inherit    'shadow))

#+end_src

Copied the =avy-jump-org-block= from [[https://www.howardabrams.com/hamacs/ha-org-literate.html][howard abrams]].
#+begin_src emacs-lisp

  (defun nox/avy-jump-org-block ()
    "Jump to org block using Avy subsystem."
    (interactive)
    (avy-jump (rx line-start (zero-or-more blank) "#+begin_src")
              :action 'goto-char)
    ;; Jump _into_ the block:
    (forward-line))

  (defun nox/avy-jump-to-link ()
    "Jump to links using Avy subsystem."
    (interactive)
    (avy-jump (rx (or "http://" "https://")) :action 'goto-char))

#+end_src

Copied over from [[https://karthinks.com/software/avy-can-do-anything/#yank-a-candidate-word-sexp-or-line][karthinks]].
#+begin_src emacs-lisp

  (defun avy-action-copy-whole-line (pt)
    (save-excursion
      (goto-char pt)
      (cl-destructuring-bind (start . end)
          (bounds-of-thing-at-point 'line)
        (copy-region-as-kill start end)))
    (select-window
     (cdr
      (ring-ref avy-ring 0)))
    t)

  (defun avy-action-yank-whole-line (pt)
    (avy-action-copy-whole-line pt)
    (save-excursion (yank))
    t)

  (defun avy-action-embark (pt)
    (unwind-protect
        (save-excursion
          (goto-char pt)
          (embark-act))
      (select-window
       (cdr (ring-ref avy-ring 0))))
    t)

  (with-eval-after-load 'avy
    (setf (alist-get ?y avy-dispatch-alist) 'avy-action-yank
          (alist-get ?w avy-dispatch-alist) 'avy-action-copy
          (alist-get ?W avy-dispatch-alist) 'avy-action-copy-whole-line
          (alist-get ?Y avy-dispatch-alist) 'avy-action-yank-whole-line
          (alist-get ?' avy-dispatch-alist) 'avy-action-embark))

#+end_src

** Browse URL
Here we customize the default behavior of when Emacs tries to open a web URL. These here are actually function that we use when matching against specific urls.
#+begin_src emacs-lisp

  (defun nox/open-in-reddigg (url &optional new-window)
    "Open the provided url in reddigg"
    (reddigg-view-comments url))

(defun nox/parse-readwise (url &optional new-window)
  "Extract, decode and open the save URL part from a given Readwise URL."
  (if (string-match "https://wise\\.readwise\\.io/save\\?url=\\(.*\\)" url)
      (browse-url (url-unhex-string (match-string 1 url)))
    (error "Invalid URL format")))

#+end_src

Now we setup rules for when to use the above defined functions. Here we have reddit for example where ~nox/open-in-reddigg~ is called whenever you try to open a URL matching the below described pattern for reddit.
#+begin_src emacs-lisp

  (setq browse-url-handlers
        '(("^https?://www\\.reddit\\.com" . nox/open-in-reddigg)
          ("^https?://arstechnica\\.com" . eww)
          ("^https?://wise\\.readwise\\.io/save\\?url=" . nox/parse-readwise)))

  (setq browse-url-generic-program "firefox")

#+end_src

** Calendar
#+begin_src emacs-lisp

  (use-package calendar
    :ensure nil
    :defer t
    :commands calendar
    :hook
    (calendar-mode . olivetti-mode)
    (calendar-mode . hide-mode-line-mode)
    (calendar-mode . (lambda () (setq-local olivetti-body-width 75)))
    (calendar-mode . (lambda () (setq-local global-hl-line-mode nil)))
    (calendar-today-visible . calendar-mark-today)
    :custom
    (calendar-mode-line-format nil)
    (calendar-mark-holidays-flag t) ;; Show holidays
    ;; disable unwanted calendar holidays
    (holiday-christian-holidays nil)
    (holiday-hebrew-holidays nil)
    (holiday-islamic-holidays nil)
    (holiday-bahai-holidays nil)
    (holiday-solar-holidays nil)
    :config
    (nox/set-calendar-colors)
    (add-hook! nox/after-theme-change #'nox/set-calendar-colors))

  (add-to-list
   'display-buffer-alist
   '("\\*Calendar\\*"
     (display-buffer-same-window)
     (body-function
      . (lambda (buf)
          (with-current-buffer buf
            (setq-local mode-line-format nil))))))

#+end_src

Update the default calendar font settings to make it prettier.
#+begin_src emacs-lisp

  (defun nox/set-calendar-colors ()
    (set-face-attribute 'holiday nil
                        :background 'unspecified
                        :foreground (doom-color 'red)
                        :underline  'unspecified)
    (require 'denote-journal)
    (set-face-attribute 'denote-journal-calendar nil
                        :box 'unspecified
                        :foreground (doom-color 'yellow))
    (set-face-attribute 'calendar-today nil
                        :foreground (doom-color 'green)
                        :underline  'unspecified))

#+end_src

** Denote
*** Notes
#+begin_src emacs-lisp

  (use-package denote
    :hook (dired-mode . denote-dired-mode)
    :custom
    (denote-directory nox/notes-directory)
    (denote-save-buffers t)
    (denote-infer-keywords t)
    (denote-sort-keywords t)
    (denote-prompts '(title keywords))
    (denote-rename-confirmations '(rewrite-front-matter modify-file-name))
    (denote-date-prompt-use-org-read-date t)
    :config
    (add-hook! denote-after-new-note #'denote-hide-metadata)
    (denote-rename-buffer-mode 1))

  (defvar denote-workspace-name "notes" "Default denote workspace name.")

  (use-package consult-denote
    :hook (on-first-input . consult-denote-mode))

  (use-package denote-explore
    :commands (denote-explore-isolated-files denote-explore-random-note)
    :custom
    (denote-explore-isolated-ignore-keywords '("journal" "podcast")))

  (use-package denote-org :defer t)

#+end_src

*** Journal
#+begin_src emacs-lisp

  (use-package denote-journal
    :hook
    (calendar-mode . denote-journal-calendar-mode)
    (denote-journal . journal-hide-metadata)
    :custom
    (denote-journal-directory nox/journal-directory)
    (denote-journal-title-format 'day-date-month-year))

  (use-package focus :commands focus-mode)

#+end_src

