config.org
*** Custom Functions
Improved UX for creating notes from inbox file.
#+begin_src emacs-lisp

  (defun nox/org-ctrl-c-ctrl-c ()
    "If in `nox/inbox-file' and in heading with CREATED, create a denote note.
  Copy only the subtree body to the kill ring, set the heading to DONE, and signal that the key has been handled."
    (when (and buffer-file-name
               (string-equal (expand-file-name buffer-file-name)
                             (expand-file-name nox/inbox-file)))
      (save-excursion
        (org-back-to-heading t)
        (let* ((element (org-element-at-point))
               (raw-contents-begin (org-element-property :contents-begin element))
               (contents-end       (org-element-property :contents-end element))
               (heading  (org-get-heading t t t t))
               (title    (denote-title-prompt heading))
               (keywords (denote-keywords-prompt))
               (created  (org-entry-get (point) "CREATED"))
               (date     (or (and created (org-time-string-to-time created))
                             (current-time)))
               contents-begin)

          ;; Compute contents-begin that skips a property drawer if present
          (when raw-contents-begin
            (goto-char raw-contents-begin)
            (if (looking-at-p "^[ \t]*:PROPERTIES:")
                (let ((drawer (org-element-at-point)))
                  (setq contents-begin (org-element-property :end drawer)))
              (setq contents-begin raw-contents-begin)))

          ;; Copy only if there is actual non-drawer contents
          (when (and contents-begin contents-end
                     (< contents-begin contents-end))
            (kill-new (buffer-substring contents-begin contents-end)))

          ;; Mark heading as DONE
          (org-todo 'done)

          ;; Create denote note
          (denote title keywords nil nil date)
          t))))

  (add-hook! org-ctrl-c-ctrl-c #'nox/org-ctrl-c-ctrl-c)

#+end_src

Custom workspace for notes.
#+begin_src emacs-lisp

  (advice-add 'denote-journal-new-or-existing-entry :before
              (lambda (&rest _args)
                (persp-switch denote-workspace-name)))

  (advice-add 'kill-current-buffer :after #'persp-kill-if-no-denote-buffer)

  (defun nox/denote-search ()
    "Uses `denote-open-or-create' as its backend and switches workspace."
    (interactive)
    (condition-case nil
        (progn
          (persp-switch denote-workspace-name)
          (call-interactively 'denote-open-or-create))
      ((quit error user-error)
       (persp-kill-if-no-denote-buffer))))

  (defun persp-denote-buffer-p (buf)
    "Return non-nil if BUF is a live Denote buffer."
    (when (buffer-live-p buf)
      (let ((name (buffer-name buf)))
        (and (stringp name)
             (string-prefix-p denote-buffer-name-prefix name)))))

  (defun persp-kill-if-no-denote-buffer ()
    "Kill the current perspective if it contains no Denote buffers."
    (interactive)
    (let ((curr-persp (persp-curr)))
      (when (and (string= (persp-name curr-persp) denote-workspace-name)
                 (not (seq-some #'persp-denote-buffer-p
                                (persp-buffers curr-persp))))
        (persp-kill (persp-name curr-persp))
        (message "Workspace killed because it has no Denote buffer."))))

#+end_src

Faces used for custom note formatting using overlays.
#+begin_src emacs-lisp

  (defface note-title-face
    '((t :height 1.6
         :weight bold
         :inherit default))
    "Face used for displaying note titles.")

  (defface note-subtitle-face
    '((t :inherit shadow
         :italic t
         :weight regular))
    "Face for note subtitle value.")

  (defface journal-title-face
    '((t :height 1.6
         :weight bold
         :inherit default))
    "Face used for displaying journal titles.")

#+end_src

#+begin_src emacs-lisp

  (defun denote--buffer-has-attachments-p ()
    (let ((dir (org-attach-dir)))
      (and dir
           (file-directory-p dir)
           (not (null (directory-files dir nil "^[^.].*"))))))

  (defun denote-hide-metadata (&rest _)
    "Render metadata as:

             Title
             AUTHOR · DATE · tag1, tag2 · +att"
    (remove-overlays (point-min) (point-max) 'denote-org-meta t)

    (let (title title-beg title-end date tags author)
      (save-excursion
        (goto-char (point-min))
        (while (re-search-forward "^#\\+\\([a-zA-Z_]+\\):\\s-*\\(.*\\)$" nil t)
          (let* ((key (downcase (match-string 1)))
                 (val (match-string 2))
                 (bol (match-beginning 0))
                 (eol (1+ (match-end 0))))
            (pcase key
              ("title"
               (setq title val
                     title-beg (match-beginning 2)
                     title-end (match-end 2))
               ;; hide keyword only
               (let ((ov (make-overlay bol title-beg)))
                 (overlay-put ov 'invisible t)
                 (overlay-put ov 'denote-org-meta t))
               ;; face title
               (let ((ov (make-overlay title-beg title-end)))
                 (overlay-put ov 'face 'note-title-face)
                 (overlay-put ov 'denote-org-meta t)))

              ("date"
               (setq date (nox/org-format-date val))
               (let ((ov (make-overlay bol eol)))
                 (overlay-put ov 'invisible t)
                 (overlay-put ov 'denote-org-meta t)))

              ("author"
               (setq author val)
               (let ((ov (make-overlay bol eol)))
                 (overlay-put ov 'invisible t)
                 (overlay-put ov 'denote-org-meta t)))

              ("filetags"
               (setq tags (nox/org-format-filetags val))
               (let ((ov (make-overlay bol eol)))
                 (overlay-put ov 'invisible t)
                 (overlay-put ov 'denote-org-meta t)))

              (_
               (let ((ov (make-overlay bol eol)))
                 (overlay-put ov 'invisible t)
                 (overlay-put ov 'denote-org-meta t)))))))

      ;; Inject composed second line
      (when (and title-end (or date tags author))
        (let* ((parts
                (delq nil
                      (list
                       (when author
                         (propertize author 'face 'note-subtitle-face))
                       (when date
                         (propertize date 'face 'note-subtitle-face))
                       (when tags
                         (propertize tags 'face 'note-subtitle-face))
                       (when (denote--buffer-has-attachments-p)
                         (propertize "‡" 'face 'note-subtitle-face)))))
               (sep (propertize " · " 'face 'shadow))
               (text (string-join parts sep))
               (ov (make-overlay title-end title-end)))
          (overlay-put ov 'after-string (concat "\n" text))
          (overlay-put ov 'denote-org-meta t)))))

  (defun denote-show-metadata ()
    "Remove Org metadata overlays."
    (remove-overlays (point-min) (point-max) 'denote-org-meta t))

  (add-hook! denote-after-rename-file #'denote-hide-metadata)

  (defun nox/org-format-filetags (s)
    "Convert :tag1:tag2:tag3: → tag1, tag2, tag3"
    (string-join
     (seq-filter (lambda (x) (not (string-empty-p x)))
                 (split-string s ":" t))
     ", "))

  (defun nox/org-format-date (s)
    "Format Org timestamp S like
           [2025-10-23 Thu 11:23] → Thu, 23 Oct 2025 - 11:23"
    (when (string-match
           "\\[\\([0-9]\\{4\\}\\)-\\([0-9]\\{2\\}\\)-\\([0-9]\\{2\\}\\) \\([A-Za-z]\\{3\\}\\) \\([0-9:]\\{5\\}\\)\\]"
           s)
      (let* ((year  (match-string 1 s))
             (month (string-to-number (match-string 2 s)))
             (day   (match-string 3 s))
             (dow   (match-string 4 s))
             (time  (match-string 5 s))
             (month-name (calendar-month-name month t)))
        (format "%s, %s %s %s - %s"
                dow day month-name year time))))

#+end_src

#+begin_src emacs-lisp

  (defun journal-hide-metadata ()
    "Hide all Org header metadata and show only the raw title text,
  styled with `journal-title-face`."
    (remove-overlays (point-min) (point-max) 'journal-meta t)
    (save-excursion
      (goto-char (point-min))
      (while (re-search-forward "^#\\+\\([a-zA-Z_]+\\):[ \t]*\\(.*\\)$" nil t)
        (let* ((key (downcase (match-string 1)))
               (val (match-string 2))
               (beg (match-beginning 0))
               (end (min (1+ (match-end 0)) (point-max))))
          (cond
           ;; Title: hide keyword, show value with face
           ((string= key "title")
            (let ((ov (make-overlay beg end)))
              (overlay-put ov 'journal-meta t)
              (overlay-put ov 'invisible t)
              (overlay-put ov 'display
                           (propertize (concat val "\n")
                                       'face 'journal-title-face))))
           ;; Other metadata: hide completely
           (t
            (let ((ov (make-overlay beg end)))
              (overlay-put ov 'journal-meta t)
              (overlay-put ov 'invisible t))))))))

  (defun journal-show-metadata ()
    "Remove journal metadata overlays."
    (remove-overlays (point-min) (point-max) 'journal-meta t))

#+end_src

#+begin_src emacs-lisp

  (define-minor-mode denote-hide-metadata-mode
    "Minor mode to toggle Denote or journal metadata display.

  If the current buffer is a journal file (filename contains \"__journal\"),
  use journal metadata functions. Otherwise, use Denote metadata functions."
    :init-value nil
    :interactive '(org-mode)
    (when-let ((file (buffer-file-name)))
      (let* ((is-journal (string-match-p "__journal"
                                         (file-name-nondirectory file)))
             (show-fn (if is-journal
                          #'journal-show-metadata
                        #'denote-show-metadata))
             (hide-fn (if is-journal
                          #'journal-hide-metadata
                        #'denote-hide-metadata)))
        (if denote-hide-metadata-mode
            (funcall hide-fn)
          (funcall show-fn)))))

#+end_src

