config.org
** Dired
The best file manager to exist. Dired is a deep rabbi-thole that you can spend multiple hours going into. Here we have setup some niceties that will help you in your journey of learning the world of dired.
#+begin_src emacs-lisp

  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    :hook
    ;; To hide dot-files by default
    (dired-mode . dired-omit-mode)
    :custom
    ;; hide files/directories starting with "." in dired-omit-mode
    (dired-omit-files (rx (seq bol ".")))
    ;; Enable "do what I mean" for target directories
    (dired-dwim-target t)

    ;; Close the previous buffer when opening a new `dired' instance
    (dired-kill-when-opening-new-dired-buffer t)
    :config
    (setq dired-free-space nil
          dired-deletion-confirmer 'y-or-n-p
          dired-clean-confirm-killing-deleted-buffers nil
          dired-recursive-deletes 'top
          dired-recursive-copies  'always
          dired-create-destination-dirs 'ask))

#+end_src

*** Diredfl
Pretty colors inside dired.
#+begin_src emacs-lisp

  (use-package diredfl
    :hook
    ;;(dired-mode . diredfl-mode)
    ;; highlight parent and directory preview as well
    (dirvish-directory-view-mode . diredfl-mode)
    :config
    (set-face-attribute 'diredfl-dir-name nil :bold t))

#+end_src

*** Dirvish
#+begin_src emacs-lisp

  (use-package dirvish
    :commands (dirvish dired)
    :hook
    (dired-mode . (lambda () (visual-line-mode -1)))
    :custom
    (dirvish-quick-access-entries
     '(("h" "~/"                          "Home")
       ("D" "~/Documents/"                "Documents")
       ("n" "~/Documents/notes/"          "Notes")
       ("d" "~/Downloads/"                "Downloads")
       ("t" "~/.local/share/Trash/files/" "Trash")))
    (dired-listing-switches
     "-l --almost-all --human-readable --group-directories-first --no-group")
    (delete-by-moving-to-trash t)
    (dirvish-mode-line-format
     '(:left (sort symlink) :right (omit yank index)))
    (dirvish-attributes
     '(nerd-icons file-time file-size collapse subtree-state vc-state git-msg))
    (dirvish-side-attributes
     '(vc-state file-size nerd-icons collapse))
    (dirvish-reuse-session 'open)
    (dirvish-mode-line-bar-image-width 0)
    (dirvish-mode-line-height 32)
    :config
    (dirvish-override-dired-mode)

    (evil-define-key 'normal dired-mode-map
      (kbd "h") 'dired-up-directory
      (kbd "l") 'dired-open-file)

    (evil-define-key 'normal dirvish-mode-map
      (kbd "?") 'dirvish-dispatch
      (kbd "a") 'dirvish-quick-access
      (kbd "TAB") 'dirvish-subtree-toggle
      (kbd "q") 'dirvish-quit)

    (dirvish-side-follow-mode))

  (use-package dirvish-emerge
    :commands (dirvish-emerge-mode)
    :ensure nil
    :config
    (setq dirvish-emerge-groups
          ;;  Header string  |   Type   |  Criterias
          '(("Recent files"  (predicate . recent-files-2h))
            ("Documents"     (extensions "pdf" "tex" "bib" "epub"))
            ("Text"          (extensions "md" "org" "txt"))
            ("Video"         (extensions "mp4" "mkv" "webm"))
            ("Pictures"      (extensions "jpg" "png" "svg" "gif"))
            ("Audio"         (extensions "mp3" "flac" "wav" "ape" "aac"))
            ("Archives"      (extensions "gz" "rar" "zip")))))

#+end_src

*** Dired Open
Opening specific files with specific programs.
#+begin_src emacs-lisp

  (use-package dired-open
    :after dirvish
    :config
    (setq dired-open-extensions '(("gif" . "imv")
                                  ("jpg" . "imv")
                                  ("webp" . "imv")
                                  ("png" . "imv")
                                  ("mkv" . "mpv")
                                  ("mp4" . "mpv"))))

#+end_src

** Elfeed
#+begin_src emacs-lisp

  (use-package elfeed
    :commands (elfeed =elfeed)
    :hook
    (elfeed-show-mode   . variable-pitch-mode)
    (elfeed-show-mode   . olivetti-mode)
    (elfeed-search-mode . olivetti-mode)
    (elfeed-search-mode . (lambda () (evil-goggles-mode -1)))
    :bind
    ([remap elfeed-search-fetch]         . nox/elfeed-refresh)
    ([remap elfeed-search-update--force] . nox/elfeed-refresh)
    ([remap elfeed-search-fetch]         . nox/elfeed-refresh)
    ([remap elfeed-search-show-entry]    . nox/elfeed-show-or-open-in-browser)
    :custom
    (elfeed-search-filter "@1-weeks-ago +unread")
    (elfeed-db-directory (expand-file-name "elfeed" minimal-emacs-user-directory))
    :config
    (require 'nano-elfeed)
    (require 'elfeed-workspace)

    (evil-define-key 'normal elfeed-search-mode-map
      (kbd "j") 'nano-elfeed-next-entry
      (kbd "r") 'nox/elfeed-refresh
      (kbd "k") 'nano-elfeed-prev-entry
      (kbd "s") 'elfeed-toggle-star)

    (defalias 'elfeed-toggle-star
      (elfeed-expose #'elfeed-search-toggle-all 'star))

    ;; add advice cause needed to hit j twice for some reason
    (advice-add 'elfeed-search-untag-all-unread :after #'nano-elfeed-next-entry)
    (advice-add 'elfeed-search-untag-all-unread :after #'evil-force-normal-state)
    (advice-add 'nox/elfeed-show-or-open-in-browser :after #'nano-elfeed-next-entry)

    ;; auto center the screen
    (advice-add 'nano-elfeed-next-entry :after #'good-scroll-center-cursor)
    (advice-add 'nano-elfeed-prev-entry :after #'good-scroll-center-cursor)
    (advice-add 'elfeed-search-untag-all-unread :after #'good-scroll-center-cursor)

    (add-hook! elfeed-search-mode
      (setq-local cursor-type nil
                  evil-normal-state-cursor nil
                  evil-insert-state-cursor nil)))

#+end_src

*** Elfeed Protocol
[[https://github.com/fasheng/elfeed-protocol][Elfeed protocol]] provides extra protocols to make self-hosted RSS readers work with elfeed.
#+begin_src emacs-lisp

  (use-package elfeed-protocol
    :after elfeed
    :custom
    (elfeed-use-curl t)
    (elfeed-curl-extra-arguments '("--insecure"))
    (elfeed-protocol-enabled-protocols '(fever))
    (elfeed-protocol-fever-update-unread-only t)
    (elfeed-protocol-fever-fetch-category-as-tag t)
    :config
    (elfeed-set-timeout 36000)
    (elfeed-protocol-enable)
    (defconst nox/freshrss-url (nox/get-secret ".identity.freshrss.url"))

    (setq elfeed-protocol-feeds `((,(concat "fever+" nox/freshrss-url)
                                   :api-url
                                   ,(concat nox/freshrss-url "/api/fever.php")
                                   :password
                                   ,(nox/get-secret ".identity.freshrss.pass")))))

#+end_src

*** Reddigg
[[https://github.com/thanhvg/emacs-reddigg][Reddigg]] allows browsing reddit items inside emacs in org-mode.
#+begin_src emacs-lisp

  (use-package reddigg :commands (reddigg-view-comments))

#+end_src

