post-init.el

;; FIXME: update logic to exempt shr-link which already contains text before it
(require 'cl-lib)

(defvar visually-cleanup-skip-faces
  '(shr-link
    message-header-name
    gnus-header-name
    gnus-button)
  "List of text faces that should prevent newline joining.")

(defun visually-cleanup-lines ()
  "Visually join single newlines and collapse multiple spaces into one.
Skips paragraph breaks and lines with '*' or faces in `visually-cleanup-skip-faces` near the newline."
  (interactive)
  (save-excursion
    (goto-char (point-min))

    ;; Collapse multiple spaces into one (visually)
    (while (re-search-forward " \\{2,\\}" nil t)
      (let ((ov (make-overlay (match-beginning 0) (match-end 0))))
        (overlay-put ov 'display " ")
        (overlay-put ov 'invisible t)
        (overlay-put ov 'read-only t)
        (overlay-put ov 'evaporate t)))

    ;; Helper to check if any unwanted face is present
    (defun face-should-skip (face)
      (cond
       ((null face) nil)
       ((symbolp face) (memq face visually-cleanup-skip-faces))
       ((listp face) (cl-some (lambda (f) (memq f visually-cleanup-skip-faces)) face))
       (t nil)))

    (goto-char (point-min))
    ;; Visually join single newlines
    (while (re-search-forward "\\([^\n]\\)\n\\([^\n]\\)" nil t)
      (let* ((pre-pos (match-beginning 1))
             (post-pos (match-beginning 2))
             (pre-char (char-after pre-pos))
             (post-char (char-after post-pos))
             (pre-face (get-text-property pre-pos 'face))
             (post-face (get-text-property post-pos 'face)))

        (unless (or (eq pre-char ?*)
                    (eq post-char ?*)
                    (face-should-skip pre-face)
                    (face-should-skip post-face))
          (let ((newline-pos (1+ pre-pos)))
            (let ((ov (make-overlay newline-pos (1+ newline-pos))))
              (overlay-put ov 'display " ")
              (overlay-put ov 'invisible t)
              (overlay-put ov 'read-only t)
              (overlay-put ov 'evaporate t)))))

      ;; Move forward to prevent infinite loop
      (goto-char (1+ (match-beginning 0))))))

(defun nox/elfeed-refresh ()
  "Refresh elfeed feed along with unread state. Only use inside elfeed search."
  (interactive)
  (mark-whole-buffer)
  (cl-loop for entry in (elfeed-search-selected)
           do (elfeed-untag-1 entry 'unread))
  (elfeed-search-update--force)
  (elfeed-protocol-fever-reinit nox/freshrss-url))

(defun nox/elfeed-show-or-open-in-browser ()
  "Open Reddit-tagged entries in external browser, else show in elfeed.
If opened externally, remove the 'unread' tag from the entry."
  (interactive)
  (let ((entry (elfeed-search-selected :ignore-region)))
    (if (memq 'Reddit (elfeed-entry-tags entry))
        (progn
          (browse-url (elfeed-entry-link entry))
          ;; Remove 'unread' tag from entry
          (elfeed-untag entry 'unread)
          ;; Refresh entry in search buffer
          (elfeed-search-update-entry entry))
      (elfeed-search-show-entry entry))))

(defun nox/elfeed-cleanup-and-exit ()
  "Save elfeed DB, kill all elfeed-related buffers, kill the current buffer, and kill the workspace."
  (interactive)
  ;; Save elfeed database
  (elfeed-db-save)

  ;; Kill all elfeed-related buffers
  (dolist (buf (buffer-list))
    (with-current-buffer buf
      (when (derived-mode-p 'elfeed-search-mode 'elfeed-show-mode)
        (kill-buffer buf))))

  ;; Kill the current workspace (Doom-specific)
  (persp-kill +elfeed-workspace-name))

(use-package transient :defer t)

(use-package gptel
  :commands gptel
  :hook
  (gptel-mode . evil-insert-state)
  (gptel-mode . hide-mode-line-mode)
  :bind* (("C-c RET" . gptel-send))
  :custom
  (gptel-model 'gpt-5-mini)
  (gptel-default-mode 'org-mode)
  (gptel-prompt-prefix-alist
   '((markdown-mode . "**Prompt:** ")
     (org-mode . "* ")
     (text-mode . "Prompt: ")))
  (gptel-response-prefix-alist
   '((markdown-mode . "**Response:** ")
     (org-mode . "")
     (text-mode . "Response: ")))
  (gptel-api-key (nox/get-secret ".api.openai"))
  :config
  (gptel-make-gemini "Gemini"
                     :key (nox/get-secret ".api.gemini")
                     :stream t)
  (add-hook! gptel-post-stream #'gptel-auto-scroll)
  (add-hook! gptel-post-response-functions #'gptel-end-of-response))

(defun nox/gptel-abort ()
  "If the buffer-name matches *ChatGPT, run `gptel-abort'."
  (when (string-match-p "^\\*ChatGPT" (buffer-name))
    (gptel-abort (current-buffer))
    t))

(add-hook! org-ctrl-c-ctrl-c-final #'nox/gptel-abort)

(use-package helpful
  :hook
  (helpful-mode . (lambda ()
                    (set-window-dedicated-p (selected-window) t)))
  (helpful-mode . hide-mode-line-mode)
  :bind
  ([remap describe-function] . helpful-callable)
  ([remap describe-command]  . helpful-command)
  ([remap describe-key]      . helpful-key)
  ([remap describe-variable] . helpful-variable)
  ([remap describe-symbol]   . helpful-symbol)
  ([remap view-hello-file]   . helpful-at-point))

(use-package elisp-demos
  :after helpful
  :custom
  (elisp-demos-user-files (list (expand-file-name "demos.org" nox/emacs-directory)))
  :config
  (advice-add 'helpful-update :after #'elisp-demos-advice-helpful-update))

(use-package jinx
  :hook
  (on-first-input . global-jinx-mode)
  :bind* (("C-/" . jinx-correct)))

(defun nox/kindle-first-page ()
  "Go to the first page of the book."
  (interactive)
  (url-retrieve "http://kindle:1337/koreader/event/GoToBeginning" #'ignore))

(defun nox/kindle-next-bookmark ()
  "Go to the next bookmark."
  (interactive)
  (url-retrieve "http://kindle:1337/koreader/event/GotoNextBookmarkFromPage" #'ignore))

(defun nox/kindle-prev-bookmark ()
  "Go to the previous bookmark."
  (interactive)
  (url-retrieve "http://kindle:1337/koreader/event/GotoPreviousBookmarkFromPage" #'ignore))

(defun nox/kindle-next-page ()
  "Go to the next page."
  (interactive)
  (url-retrieve "http://kindle:1337/koreader/event/GotoViewRel/1 " #'ignore))

(defun nox/kindle-prev-page ()
  "Go to the prev page."
  (interactive)
  (url-retrieve "http://kindle:1337/koreader/event/GotoViewRel/-1 " #'ignore))

(use-package eros
  :hook
  (on-first-input . eros-mode))
