post-init.el

(use-package nano-read :ensure (:host github :repo "rougier/nano-read"))

(defun nox/set-nano-read-colors ()
  (require 'wid-edit)
  (set-face-attribute 'nano-read-prompt-default-face nil
                      :background (doom-color 'orange)
                      :box 'unspecified)
  (set-face-attribute 'nano-read-prompt-warning-face nil
                      :foreground (doom-color 'base0)
                      :background (doom-color 'red)
                      :box 'unspecified)
  (set-face-attribute 'widget-field nil :box 'unspecified)
  (set-face-attribute 'fringe nil :background 'unspecified))

(add-hook! (nox/after-theme-change on-first-input) #'nox/set-nano-read-colors)

(defun nox/yes-or-no-p (prompt)
  "Use `nano-read-yes-or-no` as backend for `yes-or-no-p`."
  (let ((answer (nano-read-yes-or-no "" prompt)))
    (string-equal answer "YES")))

(fset 'yes-or-no-p 'nox/yes-or-no-p)
(fset 'y-or-n-p    'nox/yes-or-no-p)

(defun nox/capture-todo ()
  "Prompt for a TODO/IDEA/WAIT and its context from `nox/todo-contexts',
then write it to `nox/tasks-file'. The suffix of the description
controls the state:
  - \"!\" → IDEA
  - \"wt\" → WAIT
  - otherwise → TODO"
  (interactive)
  (let* ((todo-pair (nano-read-with-list "TODO" nox/todo-contexts))
         (raw-desc (string-trim (car todo-pair)))
         (tag      (cdr todo-pair))
         (bm-name  "recent-capture")
         (tag-str  (propertize (format "[%s]" tag)
                               'face `(:weight bold :foreground ,(doom-color 'orange))))
         ;; detect state from suffix
         (state (cond
                 ((string-suffix-p "!" raw-desc) "IDEA")
                 ((string-suffix-p "wt" raw-desc) "WAIT")
                 (t "TODO")))
         ;; strip the marker from the description
         (desc (pcase state
                 ("IDEA" (string-remove-suffix "!" raw-desc))
                 ("WAIT" (string-remove-suffix "wt" raw-desc))
                 (_      raw-desc)))
         ;; if there was an "@" in the description, prompt for a date:
         (date (when (string-suffix-p "@" desc)
                 (let ((time (org-read-date nil t nil "Schedule date: ")))
                   (format-time-string "<%Y-%m-%d %a>" time))))
         (desc (if date
                 (string-remove-suffix "@" desc)
                 desc))
         ;; final string
         (desc (string-trim desc))
         (heading (format "* %s %s :%s:\n" state desc tag)))

    (with-current-buffer (find-file-noselect nox/tasks-file)
      (goto-char (point-max))
      (insert heading)
      ;; if user supplied a date, insert a scheduled timestamp
      (when date
        (insert
         (format "  SCHEDULED: %s\n" date)))
      (save-buffer)
      (bookmark-set bm-name))

    ;; final feedback
    (if date
        (message "Added %s: %s %s on %s" state desc tag-str date)
      (message "Added %s: %s %s" state desc tag-str))))

(defun nox/capture-journal ()
  "Prompt for a JOURNAL and its date, then write it to the corresponding dailies file."
  (interactive)
  (require 'org-roam-dailies)
  (let* ((journal-pair (nano-read-with-list "JOURNAL" '("TODAY" "YESTERDAY" "TOMORROW")))
         (journal (car journal-pair))
         (date    (cdr journal-pair))
         (date-offset (cond
                       ((string-equal date "YESTERDAY") -1)
                       ((string-equal date "TOMORROW") 1)
                       (t 0)))
         (journal-date (time-add (current-time) (days-to-time date-offset))))
    (progn
      (org-roam-dailies--capture journal-date nil "d")
      (if (not (string-suffix-p "..." journal))
          (progn
            (insert journal)
            (org-capture-finalize))
        (insert (concat (string-remove-suffix "..." journal) "\n"))))
    (message "Journal entry added.")))

(use-package wasabi
  :commands wasabi
  :ensure (:host github :repo "xenodium/wasabi" :branch "main"))

(defun nox/buffer-regex-builder (names)
  "Return a regex that matches *NAMES* buffers."
  (concat
   "\\*\\("
   (mapconcat #'regexp-quote names "\\|")
   "\\)\\*"))

(setq display-buffer-alist
      `((
         ;; Embark
         ,(nox/buffer-regex-builder '("Embark Collect" "Embark Actions"))
         (display-buffer-in-side-window)
         (side . right)
         (window-width . 0.5)
         (slot . 1)
         (window-parameters . ((mode-line-format . none))))
        ;; Gptel
        ("\\*ChatGPT"
         (display-buffer-in-side-window)
         (side . right)
         (window-width . 0.5)
         (slot . 1)
         (window-dedicated . t))
        ;; Chatgpt-Shell
        ("\\*chatgpt"
         (display-buffer-in-side-window)
         (side . right)
         (window-width . 0.5)
         (slot . 1)
         (window-dedicated . t)
         (window-parameters . ((no-delete-other-windows . nil)
                               (select-window . t))))
        ;; Magit
        ((major-mode . magit-status-mode)
         (display-buffer-in-side-window)
         (side . bottom)
         (window-height . 0.5)
         (slot . 1)
         (window-dedicated . t)
         (window-parameters . ((mode-line-format . none))))
        ("*COMMIT_EDITMSG"
         (display-buffer-in-direction)
         (direction . leftmost)
         (window-width . 0.5))
        ((major-mode . magit-diff-mode)
         (display-buffer-in-direction)
         (window . root)
         (direction . right)
         (window-width . 0.5))
        ;; Special Windows
        (,(nox/buffer-regex-builder '("reddigg-comments" "vterm" "eshell" "eldoc" "use-package statistics" "compilation"))
         (display-buffer-in-side-window)
         (side . bottom)
         (window-height . 0.4)
         (slot . 1)
         (window-dedicated . t)
         (window-parameters . ((mode-line-format . none))))
        ;; Help windows
        ((or (major-mode . Info-mode)
             (major-mode . helpful-mode)
             (major-mode . help-mode))
         (display-buffer-reuse-window display-buffer-in-side-window)
         (inhibit-same-window . nil)
         (side . bottom)
         (slot . 1)
         (window-height . 0.5))
        ("*Calender*"
         (display-buffer-reuse-window display-buffer-in-direction)
         (direction . bottom)
         (window-dedicated . t)
         (window-height . 0.4))
        ;; Org Mode
        ("CAPTURE-"
         (display-buffer-reuse-window display-buffer-in-direction)
         (direction . bottom)
         (inhibit-same-window . nil)
         (window-height . 0.4))
        ((major-mode . org-mode)
         (display-buffer-reuse-window display-buffer-same-window display-buffer-in-direction)
         (direction . right)
         (window-width . 0.5))
        ;; Elpaca
        ((major-mode . elpaca-log-mode)
         (display-buffer-in-side-window)
         (side . right)
         (window-width . 0.18)
         (slot . 1)
         (window-parameters . ((mode-line-format . none))))))
