post-init.el

;; Deleting and renaming of current file
(use-package bufferfile
  :custom
  (bufferfile-use-vc t)
  (bufferfile-delete-switch-to 'previous-buffer)
  :commands (bufferfile-rename bufferfile-delete))

;; Sudo edit the current file
(use-package sudo-edit
  :commands (sudo-edit-find-file sudo-edit))

(defun nox/run-commands-for-buffer-names ()
  "Run specific commands for certain buffer names."
  (let ((buffer-name (buffer-name)))
    (cond
     ((string= buffer-name "*elfeed-entry*")
      ;; cleanup lines and make olivetti-mode work better
      (visually-cleanup-lines))

     ((string= buffer-name "*elpaca-log*")
      (visual-line-mode -1))

     ((string= buffer-name "*reddigg-comments*")
      (jinx-mode -1)
      (org-appear-mode -1)
      (evil-goto-first-line)
      ;; convert all md links to org links
      (nox/md-to-org-links)
      (nox/md-code-blocks-to-org)
      (nox/md-blockquotes-to-org)
      ;; make the window dedicated
      (set-window-dedicated-p (selected-window) t)
      ;; easier quitting of the window
      (evil-local-set-key 'normal "q" 'kill-current-buffer)
      ;; open all folds
      (org-fold-show-all)
      (read-only-mode)))))

;; Add the function to hooks
(add-hook! buffer-list-update #'nox/run-commands-for-buffer-names)

;; (use-package buffer-terminator
;;   :hook (on-first-input . buffer-terminator-mode))

(use-package nerd-icons-ibuffer
  :hook (ibuffer-mode . nerd-icons-ibuffer-mode))

(use-package ibuffer
  :ensure nil
  :commands (ibuffer persp-ibuffer)
  :hook
  (ibuffer-mode . (lambda () (display-line-numbers-mode -1)))
  (ibuffer-mode . (lambda () (visual-line-mode -1))))

(use-package perspective
  :hook
  (on-first-input . persp-mode)
  :custom
  (persp-mode-prefix-key (kbd "C-c b"))
  (persp-initial-frame-name "main")
  (persp-sort 'created)
  :config
  (persp-turn-off-modestring))

(defun +list-workspaces ()
  "List all workspaces, numbering them and highlighting the current one."
  (interactive)
  (let* ((all-persp (persp-names))
         (current (persp-name (persp-curr)))
         (msg (mapconcat
               (lambda (p)
                 (let* ((i (1+ (cl-position p all-persp :test #'equal)))
                        (label (format "[%d] %s" i p)))
                   (if (equal p current)
                       (propertize label 'face `(:weight bold :foreground ,(doom-color 'orange)))
                     label)))
               all-persp
               " ")))  ; <-- just space between items
    (message "Workspaces: %s" msg)))

(add-hook! persp-switch #'+list-workspaces)

(defun +workspace-switch-advice (&rest _)
       (if (= (length (persp-names)) 1)
           (message "No other workspace.")))

(advice-add 'persp-next :before #'+workspace-switch-advice)
(advice-add 'persp-prev :before #'+workspace-switch-advice)

(defun +project-workspace-create (&rest _)
  (persp-switch (file-name-nondirectory (directory-file-name (projectile-acquire-root))))
  (projectile-find-file)
  (+list-workspaces))

(setq projectile-switch-project-action '+project-workspace-create)

;; truncate line with …
(set-display-table-slot standard-display-table 'truncation (make-glyph-code ?…))
;; wrap line with —
(set-display-table-slot standard-display-table 'wrap (make-glyph-code ?–))

(set-face-attribute 'variable-pitch nil
                    :family "Inter"
                    :height 140
                    :weight 'regular)

(set-face-attribute 'fixed-pitch nil
                    :family "CaskaydiaCove Nerd Font"
                    :height 140
                    :weight 'regular)

(set-face-attribute 'default nil
                    :family "CaskaydiaCove Nerd Font"
                    :height 140
                    :weight 'regular)

(set-face-attribute 'fixed-pitch-serif nil
                    :inherit 'fixed-pitch
                    :family 'unspecified)

(add-to-list 'default-frame-alist '(font . "CaskaydiaCove Nerd Font-14"))

(defun nox/set-fonts ()
  "Set fonts and face attributes."
  ;; setting the emoji font family
  ;; https://emacs.stackexchange.com/a/80186
  (set-fontset-font t 'emoji
                    '("Apple Color Emoji" . "iso10646-1") nil 'prepend)

  ;; italic comments and keywords
  (set-face-attribute 'font-lock-comment-face nil :italic t)

  ;; setting the line spacing
  (setq-default line-spacing 0.16))

(add-hook! on-first-input #'nox/set-fonts)

(use-package mixed-pitch
  :hook (text-mode . mixed-pitch-mode))

(use-package olivetti
  :hook (org-mode . olivetti-mode)
  :custom
  (olivetti-body-width 110))

(use-package ultra-scroll
  :hook (on-first-input . ultra-scroll-mode)
  :init
  (setq scroll-conservatively 3 ; or whatever value you prefer, since v0.4
        scroll-margin 0)        ; important: scroll-margin more than 0 not yet supported
  :config
  (add-hook 'ultra-scroll-hide-functions #'hl-todo-mode)
  (add-hook 'ultra-scroll-hide-functions #'diff-hl-flydiff-mode)
  (add-hook 'ultra-scroll-hide-functions #'jit-lock-mode)
  (add-hook 'ultra-scroll-hide-functions #'good-scroll-mode))

(use-package good-scroll
  :hook (on-first-input . good-scroll-mode)
  :bind
  ([remap evil-scroll-up] . good-scroll-down-half-screen)
  ([remap evil-scroll-line-to-center] . good-scroll-center-cursor)
  ([remap evil-scroll-down] . good-scroll-up-half-screen)
  :config

  (defun good-scroll-center-cursor ()
    "Scroll cursor to center."
    (interactive)
    (let* ((pixel-y (cdr (posn-x-y (posn-at-point))))               ; cursor vertical position
           (half-window (/ (good-scroll--window-usable-height) 2))  ; half of usable window height
           (delta (- pixel-y half-window)))                         ; difference from center
      (good-scroll-move delta)))

  (defun good-scroll-up-half-screen ()
    "Scroll up by half screen."
    (interactive)
    (good-scroll-move (/ (good-scroll--window-usable-height) 2)))

  (defun good-scroll-down-half-screen ()
    "Scroll down by half screen."
    (interactive)
    (good-scroll-move (- (/ (good-scroll--window-usable-height) 2)))))

(use-package spacious-padding
  :hook
  (on-init-ui . spacious-padding-mode))
