post-init.el

(use-package evil-goggles
  :hook (on-first-file . evil-goggles-mode)
  :init
  (setq evil-goggles-duration 0.1
        evil-goggles-pulse nil ; too slow
        ;; evil-goggles provides a good indicator of what has been affected.
        ;; delete/change is obvious, so I'd rather disable it for these.
        evil-goggles-enable-delete nil
        evil-goggles-enable-change nil)
  :config
  ;; optionally use diff-mode's faces; as a result, deleted text
  ;; will be highlighed with `diff-removed` face which is typically
  ;; some red color (as defined by the color theme)
  ;; other faces such as `diff-added` will be used for other actions
  (evil-goggles-use-diff-faces))

(use-package doom-modeline
  :hook
  (on-init-ui . doom-modeline-mode)
  :init
  (setq doom-modeline-support-imenu t)
  :config
  (setq doom-modeline-major-mode-icon nil)
  (setq find-file-visit-truename t)
  (setq doom-modeline-icon t)
  (setq doom-modeline-buffer-encoding nil)
  (setq doom-modeline-percent-position nil)
  (setq doom-modeline-height 36))

(use-package hide-mode-line :commands hide-mode-line-mode)

;; (use-package nano-modeline
;;   :hook
;;   (prog-mode            . nano-modeline-prog-mode)
;;   (text-mode            . nano-modeline-text-mode)
;;   (org-mode             . nano-modeline-org-mode)
;;   (pdf-view-mode        . nano-modeline-pdf-mode)
;;   (mu4e-headers-mode    . nano-modeline-mu4e-headers-mode)
;;   (mu4e-view-mode       . nano-modeline-mu4e-message-mode)
;;   (mu4e-compose-mode    . nano-modeline-mu4e-compose-mode)
;;   (elfeed-show-mode     . nano-modeline-elfeed-entry-mode)
;;   (elfeed-search-mode   . nano-modeline-elfeed-search-mode)
;;   (elpher-mode          . nano-modeline-elpher-mode)
;;   (term-mode            . nano-modeline-term-mode)
;;   (eat-mode             . nano-modeline-eat-mode)
;;   (xwidget-webkit-mode  . nano-modeline-xwidget-mode)
;;   (messages-buffer-mode . nano-modeline-message-mode)
;;   (org-capture-mode     . nano-modeline-org-capture-mode)
;;   (org-agenda-mode      . nano-modeline-org-agenda-mode)
;;   :init
;;   (nano-modeline-prog-mode t)
;;   :config
;;   (dolist (spec '((status-**-active nox/buffer-modified-status nil)
;;                   (name-active      nox/buffer-name-active)))
;;     (setf (cdr (assoc (car spec) nano-modeline-faces))
;;           (cdr spec))))
;;
;; (setq-default mode-line-format "")
;;
;; (make-face 'nox/buffer-modified-status)
;; (make-face 'nox/buffer-name-active)
;;
;; (defun nox/set-modeline-faces ()
;;   (set-face-attribute 'nano-modeline-button-active-face nil
;;                       :box `(:line-width 2 :color ,(doom-color 'base3) :style flat-button)
;;                       :foreground (doom-color 'bg)
;;                       :background (doom-color 'orange))
;;
;;   (set-face-attribute 'nano-modeline-button-inactive-face nil
;;                       :box `(:line-width 2 :color ,(doom-color 'base3) :style flat-button)
;;                       :foreground (doom-color 'bg)
;;                       :background (doom-color 'grey))
;;
;;   (set-face-attribute 'nano-modeline-active nil
;;                       :inherit nil
;;                       :box `(:line-width 1 :color ,(doom-color 'base3))
;;                       :foreground (doom-color 'grey)
;;                       :background (doom-color 'base3))
;;
;;   (set-face-attribute 'nano-modeline-status nil
;;                       :foreground (doom-color 'bg)
;;                       :background (doom-color 'dark-cyan))
;;
;;   (set-face-attribute 'nox/buffer-modified-status nil
;;                       :foreground (doom-color 'bg)
;;                       :background (doom-color 'orange))
;;
;;   (set-face-attribute 'nox/buffer-name-active nil
;;                       :inherit 'bold
;;                       :foreground (doom-color 'fg))
;;
;;   (set-face-attribute 'mode-line nil
;;                       :height 1
;;                       :background (doom-color 'bg)
;;                       :underline (doom-color 'base3))
;;
;;   (set-face-attribute 'mode-line-inactive nil
;;                       :height 1
;;                       :background (doom-color 'bg)
;;                       :underline (doom-color 'base3)))
;;
;; (add-hook! (nox/after-theme-change on-init-ui) #'nox/set-modeline-faces)

(let ((theme-file (expand-file-name "~/.cache/theme-status")))
  (setq doom-theme
        (if (and (file-exists-p theme-file)
                 (with-temp-buffer
                   (insert-file-contents theme-file)
                   (string-match-p "light" (buffer-string))))
            'doom-gruvbox-light ;; light theme
          'doom-gruvbox)))      ;; fallback theme or dark theme

(use-package doom-themes
  :custom
  (doom-themes-enable-bold t)
  (doom-themes-enable-italic t)
  :config
  (add-hook! on-init-ui #'nox/theme-setup))

(defun nox/theme-setup()
  (load-theme doom-theme t)
  (doom-themes-org-config))

(use-package org
  :ensure nil
  :defer t
  :init
  ;; Using RETURN to follow links in Org/Evil
  ;; Unmap keys in 'evil-maps if not done, (setq org-return-follows-link t) will not work
  (with-eval-after-load 'evil-maps
    (define-key evil-motion-state-map (kbd "SPC") nil)
    (define-key evil-motion-state-map (kbd "RET") nil)
    (define-key evil-motion-state-map (kbd "TAB") nil))
  ;; Setting RETURN key in org-mode to follow links
  (setq org-return-follows-link  t)
  :hook
  ;; (org-mode . org-indent-mode)
  (org-mode . prettify-symbols-mode)
  (org-mode . visual-line-mode)
  (org-mode . variable-pitch-mode)
  (org-capture-mode . evil-insert-state)
  (org-mode . org-fold-hide-drawer-all)
  (org-mode . (lambda ()
                (add-hook! before-save :local #'org-update-all-dblocks)))
  :custom
  (org-ellipsis "...")
  (org-confirm-babel-evaluate nil)
  (org-M-RET-may-split-line nil)
  (org-startup-with-latex-preview nil)
  (org-attach-id-dir "attachments/")
  (org-attach-use-inheritance t)
  (org-attach-method 'mv)
  (org-startup-with-link-previews t)
  (org-hide-drawer-startup t)
  (org-image-align 'center)
  (org-image-actual-width nil)
  (org-fontify-quote-and-verse-blocks t)
  (org-support-shift-select t)
  (org-hide-emphasis-markers t)
  (org-hide-leading-stars t)
  :config
  (nox/set-org-faces)
  (require 'inbox-notes-dblock))

(defun nox/set-org-faces ()
  (set-face-attribute 'org-ellipsis nil
                      :foreground 'unspecified
                      :inherit '(org-meta-line))
  (set-face-attribute 'org-special-keyword nil
                      :foreground 'unspecified
                      :inherit '(org-meta-line))
  (set-face-attribute 'org-drawer nil
                      :foreground 'unspecified
                      :inherit '(org-meta-line))
  (set-face-attribute 'org-quote nil
                      :family 'unspecified
                      :slant 'italic
                      :inherit '(variable-pitch org-block)))

(defun nox/org-collapse-done-subtrees ()
  "Fold all Org subtrees marked DONE."
  (interactive)
  (org-map-entries
   (lambda ()
     (org-fold-hide-subtree))
   "/DONE"
   'file))
