config.org
** Org Agenda
#+begin_src emacs-lisp

  (use-package org-agenda
    :ensure nil
    :after org
    :commands org-agenda
    :hook
    (org-agenda-mode . olivetti-mode)
    (org-agenda-mode . hide-mode-line-mode)
    :bind
    (:map org-agenda-mode-map
          ("<escape>" . org-agenda-quit))
    :custom
    (org-log-done 'time)
    (org-log-reschedule 'note)
    (org-log-redeadline 'note)
    (org-log-into-drawer t)
    ;; (org-agenda-files (list nox/tasks-file nox/events-file nox/holidays-file))
    (org-agenda-files (list nox/tasks-file))
    (org-agenda-skip-timestamp-if-done t)
    (org-agenda-skip-scheduled-if-done t)
    (org-agenda-skip-deadline-if-done t)
    (org-agenda-skip-scheduled-if-deadline-is-shown t)
    (org-agenda-skip-timestamp-if-deadline-is-shown t)
    (org-agenda-current-time-string "← now ──────────")
    (org-agenda-start-on-weekday 0)
    (org-agenda-weekend-days '(6))
    :config
    (set-face-attribute 'org-scheduled nil
                        :foreground (doom-color 'fg))

    (setq org-agenda-prefix-format
          '((agenda . "  %i %?-12t")
            (todo   . "  %i %?-12t")
            (tags   . "  %i %?-12t")
            (search . "  %i %?-12t")))

    (setq org-todo-keywords
          '((sequence "TODO(t)" "NEXT(n)" "IDEA(i@)" "WAIT(w@/!)" "EVNT(e)" "|" "DONE(d!)" "CANC(c@)")))

    (setq org-agenda-category-icon-alist
          '(("tasks"     ("") nil nil :ascent center)
            ("holidays"  ("") nil nil :ascent center)
            ("events"    ("") nil nil :ascent center)))

    (add-hook! org-agenda-mode
      (setq-local cursor-type nil
                  evil-normal-state-cursor nil
                  evil-insert-state-cursor nil)))

#+end_src

** Better Latex Blocks
#+begin_src emacs-lisp

  (use-package org-fragtog
    :defer t
    :hook
    (org-mode . (lambda ()
                  (add-hook! evil-insert-state-entry :local #'org-fragtog-mode)
                  (add-hook! evil-insert-state-exit  :local #'org-latex-preview)
                  (add-hook! evil-insert-state-exit  :local (org-fragtog-mode -1)))))

#+end_src

** Org Superstar
[[https://github.com/integral-dw/org-superstar-mode][Org Superstar]] prettifies headings and plain lists in org mode.
#+begin_src emacs-lisp

  (use-package org-superstar
    :hook
    (org-mode . org-superstar-mode)
    :custom
    (org-superstar-headline-bullets-list
     '("◉" "◈" "○" "▷"))
    (org-superstar-cycle-headline-bullets nil)
    (org-superstar-remove-leading-stars t)
    ;; 42 = *
    ;; 43 = +
    ;; 45 = -
    (org-superstar-item-bullet-alist '((42 . 8226) (43 . 10148) (45 . 8226)))
    :config
    (set-face-attribute 'org-superstar-leading nil :height 1.3)
    (set-face-attribute 'org-superstar-header-bullet nil
                        :height 1.2
                        :inherit 'fixed-pitch)
    (set-face-attribute 'org-superstar-item nil :height 1.2))

#+end_src

** Prettify Symbols
#+begin_src emacs-lisp

  (setq-default prettify-symbols-alist
                '(("#+begin_src emacs-lisp" . "")
                  ("#+begin_src elisp" . "")
                  ("#+begin_src nix" . "")
                  ("#+begin_src shell" . "")
                  (":ATTACH:" . "🔗")
                  ("#+attr_org:" . "")
                  ;; better start and end
                  ("#+begin_src" . "»")
                  ("#+end_src" . "«")
                  ("#+BEGIN:" . "»")
                  ("#+END:" . "«")
                  ("#+begin_example" . "»")
                  ("#+end_example" . "«")
                  ;; quote
                  ("#+begin_quote" . "")
                  ("#+end_quote" . "")
                  ;; babel
                  ("#+RESULTS:" . "󰥤")
                  (":tangle" . "󰯊")
                  (":mkdirp yes" . "")
                  ;; elisp
                  ("lambda" . "󰘧")
                  ("(interactive)" . "")))

    (setq prettify-symbols-unprettify-at-point 'right-edge)

#+end_src

** Small Utilities
#+begin_src emacs-lisp

  (use-package toc-org
    :hook (org-mode . toc-org-mode))

  (use-package org-auto-tangle
    :hook (org-mode . org-auto-tangle-mode))

  (use-package org-autolist
    :hook (org-mode . org-autolist-mode))

  (use-package org-appear
    :defer t
    :hook
    (org-mode . (lambda ()
                  (org-appear-mode)
                  (add-hook! evil-insert-state-entry :local #'org-appear-manual-start)
                  (add-hook! evil-insert-state-exit  :local #'org-appear-manual-stop)))
    :custom
    (org-appear-autolinks t)
    (org-appear-trigger 'manual))

  (with-eval-after-load 'org
    (require 'org-tempo)
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("go" . "src go"))
    (add-to-list 'org-structure-template-alist '("nix" . "src nix"))
    (add-to-list 'org-structure-template-alist '("py" . "src python")))

#+end_src

* Mini-buffer Completions
