config.org
** Consult
Consult offers a suite of commands for efficient searching, previewing, and interacting with buffers, file contents, and more, improving various tasks.
#+begin_src emacs-lisp

  (use-package consult
    ;; Enable automatic preview at point in the *Completions* buffer.
    :hook (completion-list-mode . consult-preview-at-point-mode)
    :bind
    ([remap bookmark-jump] . consult-bookmark)
    ([remap evil-show-marks] . consult-mark)
    ([remap evil-show-registers] . consult-register)
    ([remap goto-line] . consult-goto-line)
    ([remap imenu] . consult-imenu)
    ([remap Info-search] . consult-info)
    ([remap locate] . consult-locate)
    ([remap load-theme] . consult-theme)
    ([remap recentf-open-files] . consult-recent-file)
    ([remap switch-to-buffer] . consult-buffer)
    ([remap switch-to-buffer-other-window] . consult-buffer-other-window)
    ([remap switch-to-buffer-other-frame] . consult-buffer-other-frame)
    ([remap yank-pop] . consult-yank-pop)
    :init
    ;; Optionally configure the register formatting. This improves the register
    (setq register-preview-delay 0.5
          register-preview-function #'consult-register-format)

    ;; Optionally tweak the register preview window.
    (advice-add #'register-preview :override #'consult-register-window)

    ;; Use Consult to select xref locations with preview
    (setq xref-show-xrefs-function #'consult-xref
          xref-show-definitions-function #'consult-xref)

    ;; Aggressive asynchronous that yield instantaneous results. (suitable for
    ;; high-performance systems.) Note: Minad, the author of Consult, does not
    ;; recommend aggressive values.
    ;; Read: https://github.com/minad/consult/discussions/951
    ;;
    ;; However, the author of minimal-emacs.d uses these parameters to achieve
    ;; immediate feedback from Consult.
    (setq consult-async-input-debounce 0.02
          consult-async-input-throttle 0.05
          consult-async-refresh-delay 0.02)

    :config
    ;; persp with consult
    (with-eval-after-load 'perspective
      (consult-customize consult-source-buffer :hidden t :default nil)
      (add-to-list 'consult-buffer-sources 'persp-consult-source))

    (consult-customize
     consult-theme :preview-key '(:debounce 0.2 any)
     consult-ripgrep consult-git-grep consult-grep
     consult-bookmark consult-recent-file consult-xref
     consult-source-bookmark consult-source-file-register
     consult-source-recent-file consult-source-project-recent-file
     ;; :preview-key "M-."
     :preview-key '(:debounce 0.4 any))
    (setq consult-narrow-key "<"))

#+end_src

Copied over from [[https://github.com/MiniApollo/config/blob/main/emacs/init.org#consult-dir][kickstart.emacs]].
#+begin_src emacs-lisp

  (use-package consult-dir
    :bind (("C-x C-d" . consult-dir)
           :map vertico-map
           ("C-x C-d" . consult-dir)
           ("C-x C-j" . consult-dir-jump-file))
    :custom
    (consult-dir-default-command #'consult-dir-dired)
    :config
    (setq consult-dir-project-list-function #'consult-dir-projectile-dirs)

    ;; A function that returns a list of directories
    (defun consult-dir--work-dirs ()
      "Return list of work dirs."
      (append
       (split-string (shell-command-to-string "find ~/.config -maxdepth 1 -type d") "\n" t)))

    ;; A consult source that calls this function
    (defvar consult-dir--source-work
      `(:name     "Work Directories"
                  :narrow   ?w
                  :category file
                  :face     consult-file
                  :history  file-name-history
                  :enabled  ,(lambda () (executable-find "find"))
                  :items    ,#'consult-dir--work-dirs)
      "Work directory source for `consult-dir'.")

    ;; Adding to the list of consult-dir sources
    (add-to-list 'consult-dir-sources 'consult-dir--source-work t))

#+end_src

** Embark
Embark integrates with Consult and Vertico to provide context-sensitive actions and quick access to commands based on the current selection, further improving user efficiency and workflow within Emacs. Together, they create a cohesive and powerful environment for managing completions and interactions.
#+begin_src emacs-lisp

  (use-package embark
    ;; Embark is an Emacs package that acts like a context menu, allowing
    ;; users to perform context-sensitive actions on selected items
    ;; directly from the completion interface.
    :commands (embark-act
               embark-dwim
               embark-export
               embark-collect
               embark-bindings
               embark-prefix-help-command)
    :bind*
    (("C-'" . embark-act)
     ("C-;" . embark-dwim))
    (:map embark-general-map
          ("G" . gptel-send)
          ("?" . gptel-quick))
    :init
    (setq prefix-help-command #'embark-prefix-help-command))

  (use-package embark-consult
    :hook
    (embark-collect-mode . consult-preview-at-point-mode))

#+end_src

** Extended Settings
#+begin_src emacs-lisp

  (use-package emacs
    :ensure nil
    :custom
    ;; Hide commands in M-x which do not work in the current mode.  Vertico
    ;; commands are hidden in normal buffers. This setting is useful beyond
    ;; Vertico.
    (read-extended-command-predicate #'command-completion-default-include-p)
    :init
    ;; Add prompt indicator to `completing-read-multiple'.
    ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
    (defun crm-indicator (args)
      (cons (format "[CRM%s] %s"
                    (replace-regexp-in-string
                     "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                     crm-separator)
                    (car args))
            (cdr args)))
    (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

    ;; Do not allow the cursor in the minibuffer prompt
    (setq minibuffer-prompt-properties
          '(read-only t cursor-intangible t face minibuffer-prompt))
    (add-hook! minibuffer-setup #'cursor-intangible-mode))

#+end_src

** Marginalia
Marginalia allows Embark to offer you preconfigured actions in more contexts. In addition to that, Marginalia also enhances Vertico by adding rich annotations to the completion candidates displayed in Vertico's interface.
#+begin_src emacs-lisp

  (use-package marginalia
    :commands (marginalia-mode marginalia-cycle)
    :hook (on-first-input . marginalia-mode))

  (use-package nerd-icons-completion
    :hook
    (marginalia-mode . nerd-icons-completion-marginalia-setup))
#+end_src

** Orderless
Vertico leverages Orderless' flexible matching capabilities, allowing users to input multiple patterns separated by spaces, which Orderless then matches in any order against the candidates.
#+begin_src emacs-lisp

  (use-package orderless
    :after vertico
    :custom
    (completion-styles '(orderless basic))
    (completion-category-defaults nil)
    (completion-category-overrides '((file (styles partial-completion)))))

#+end_src

