config.org
** Vertico
Vertico provides a vertical completion interface, making it easier to navigate and select from completion candidates (e.g., when `M-x` is pressed).
#+begin_src emacs-lisp

  (use-package vertico
    :hook
    (on-first-input . vertico-mode)
    :custom
    (vertico-count 13)
    (vertico-resize t)
    (vertico-cycle t)
    :bind (:map vertico-map
                ("C-j"      . vertico-next)
                ("C-M-j"    . vertico-next-group)
                ("C-k"      . vertico-previous)
                ("C-M-k"    . vertico-previous-group)
                ("M-RET"    . vertico-exit-input)
                ("<escape>" . minibuffer-keyboard-quit))
    :config
    ;; Add » before the selected completion.
    (advice-add #'vertico--format-candidate :around
                (lambda (orig cand prefix suffix index _start)
                  (setq cand (funcall orig cand prefix suffix index _start))
                  (concat
                   (if (= vertico--index index)
                       (propertize "» " 'face 'vertico-current)
                     "  ")
                   cand))))

#+end_src

Configure directory extension.
#+begin_src emacs-lisp

  (use-package vertico-directory
    :after vertico
    :ensure nil
    ;; More convenient directory navigation commands
    :bind (:map vertico-map
                ("RET" . vertico-directory-enter)
  	          ("DEL" . vertico-directory-delete-char))
    ;; Tidy shadowed file names
    :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))

#+end_src

#+begin_src emacs-lisp

  (use-package vertico-multiform
    :ensure nil
    :hook (vertico-mode . vertico-multiform-mode)
    :config
    (defvar +vertico-transform-functions nil)

    (cl-defmethod vertico--format-candidate :around
      (cand prefix suffix index start &context ((not +vertico-transform-functions) null))
      (dolist (fun (ensure-list +vertico-transform-functions))
        (setq cand (funcall fun cand)))
      (cl-call-next-method cand prefix suffix index start))

    (defun +vertico-highlight-directory (file)
      "If FILE ends with a slash, highlight it as a directory."
      (when (string-suffix-p "/" file)
        (add-face-text-property 0 (length file) 'marginalia-file-priv-dir 'append file))
      file)

    (defun +vertico-highlight-enabled-mode (cmd)
      "If MODE is enabled, highlight it as font-lock-constant-face."
      (let ((sym (intern cmd)))
        (with-current-buffer (nth 1 (buffer-list))
          (if (or (eq sym major-mode)
                  (and
                   (memq sym minor-mode-list)
                   (boundp sym)
                   (symbol-value sym)))
              (add-face-text-property 0 (length cmd) 'font-lock-constant-face 'append cmd)))
        cmd))

    (add-to-list 'vertico-multiform-categories
                 '(file
                   (+vertico-transform-functions . +vertico-highlight-directory)))
    (add-to-list 'vertico-multiform-commands
                 '(execute-extended-command
                   (+vertico-transform-functions . +vertico-highlight-enabled-mode))))

#+end_src

* Development
** Encryption
SOPS is a CLI tool to encrypt/decrypt “secrets” inside files so they can be put inside version control safely. Here SOPS is an Emacs minor mode which makes operating on SOPS files easier and prevents corruption.
#+begin_src emacs-lisp

  (use-package sops
    :hook
    (yaml-ts-mode . sops-mode)
    :bind
    (:map yaml-ts-mode-map
          ("C-c C-c" . sops-save-file)
          ("C-c C-k" . sops-cancel)
          ("C-c C-d" . sops-edit-file)))

#+end_src

** Completions
[[https://github.com/minad/corfu][Corfu]] enhances in-buffer completion by displaying a compact popup with current candidates, positioned either below or above the point. Candidates can be selected by navigating up or down.
#+begin_src emacs-lisp

  (use-package corfu
    :hook
    (on-first-input . global-corfu-mode)
    (prog-mode . corfu-mode)
    (shell-mode . corfu-mode)
    (eshell-mode . corfu-mode)
    :custom
    (corfu-cycle t)                     ;; Enable cycling for `corfu-next/previous'
    (corfu-auto t)                      ;; Enable auto completion
    (corfu-auto-prefix 2)               ;; Enable auto completion
    (corfu-auto-delay 0.24)             ;; Enable auto completion
    (corfu-preview-current 'insert)     ;; Disable current candidate preview
    (corfu-on-exact-match nil)          ;; Configure handling of exact matches
    (corfu-scroll-margin 5)             ;; Use scroll margin
    (corfu-quit-at-boundary 'separator) ;; Quit completion unless seperator
    :bind
    (:map corfu-map
          ("M-SPC" . corfu-insert-separator))
    :config
    (set-face-attribute 'corfu-default nil :inherit 'fixed-pitch)
    (nox/set-corfu-colors)
    (add-hook 'evil-insert-state-exit-hook #'corfu-quit))

  (defun nox/set-corfu-colors ()
    (when (featurep 'corfu)
      (set-face-attribute 'corfu-default nil :background (doom-color 'bg))
      (set-face-attribute 'corfu-current nil :background (doom-color 'bg-alt))))

  (add-hook! nox/after-theme-change #'nox/set-corfu-colors)

#+end_src

Here we are adding icons to corfu.
#+begin_src emacs-lisp

  (use-package nerd-icons-corfu
    :after corfu
    :config
    (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

#+end_src

Here we are enabling ~corfu-history~. This allows sorting of completions by the frequency of their use.
#+begin_src emacs-lisp

  (use-package corfu-history
    :after (corfu savehist)
    :ensure nil
    :hook
    (corfu-mode . corfu-history-mode)
    :config
    (add-to-list 'savehist-additional-variables 'corfu-history))

#+end_src

Here we setup popup-info for the completion candidate.
#+begin_src emacs-lisp

  (use-package corfu-popupinfo
    :ensure nil
    :hook (corfu-mode . corfu-popupinfo-mode)
    :custom
    (corfu-popupinfo-delay '(0.2 . 0.5)))

#+end_src

Changing emacs settings so that we remove commands that do not apply to the current mode. We also disable the ispell completion function.
#+begin_src emacs-lisp

  (use-package emacs
    :ensure nil
    :custom
    (tab-always-indent 'complete)
    ;; Emacs 30 and newer: Disable Ispell completion function. As an alternative,
    ;; try `cape-dict'.
    (text-mode-ispell-word-completion nil)

    ;; Hide commands in M-x which do not apply to the current mode.  Corfu
    ;; commands are hidden, since they are not used via M-x. This setting is
    ;; useful beyond Corfu.
    (read-extended-command-predicate #'command-completion-default-include-p))

#+end_src

[[https://github.com/minad/cape][Cape]], or Completion At Point Extensions, extends the capabilities of in-buffer completion. It integrates with Corfu or the default completion UI, by providing additional backends through completion-at-point-functions.
#+begin_src emacs-lisp

  (use-package cape
    :commands (cape-dabbrev cape-file cape-elisp-block)
    :bind ("C-c p" . cape-prefix-map)
    :init
    (add-hook 'completion-at-point-functions #'cape-dabbrev)      ;; word completion from buffer
    (add-hook 'completion-at-point-functions #'cape-file)         ;; file name completion
    (add-hook 'completion-at-point-functions #'cape-keyword))

#+end_src

** LSP
#+begin_src emacs-lisp

  (use-package eglot
    :ensure nil
    :hook
    (prog-mode . eglot-ensure)
    (eglot-managed-mode . nox/eglot-remove-signature-eldoc)
    :commands
    (eglot-ensure
     eglot-rename
     eglot-format-buffer)
    :bind
    ([remap eldoc-doc-buffer] . eldoc-box-help-at-point)
    :config
    ;; ensure rass is installed
    (nox/mason-ensure '("rass"))

    ;; inly hint face
    (set-face-attribute 'eglot-inlay-hint-face nil
                        :inherit 'font-lock-comment-face
                        :italic t))

  (defun nox/eglot-remove-signature-eldoc ()
    (setq-local eldoc-documentation-functions
                (remove #'eglot-signature-eldoc-function eldoc-documentation-functions)))

#+end_src

Documentation.
#+begin_src emacs-lisp

  (use-package markdown-mode
    :init
    ;; hover signature help face
    (set-face-attribute 'markdown-code-face nil
                        :background 'unspecified))

  (use-package eldoc-box
    :commands eldoc-box-help-at-point
    :config
    (nox/set-eldoc-box-colors)
    (add-hook! nox/after-theme-change #'nox/set-eldoc-box-colors))

  (use-package sideline-flymake
    :hook
    (flymake-mode . sideline-mode)
    (sideline-mode . nox/sideline-remove-flymake-eldoc)
    :custom
    (sideline-flymake-display-mode 'line)
    (sideline-backends-right '(sideline-flymake)))

  (defun nox/set-eldoc-box-colors ()
    (set-face-attribute 'eldoc-box-border nil
                        :background 'unspecified
                        :inherit 'corfu-border)

    (set-face-attribute 'eldoc-box-markdown-separator nil
                        :foreground (doom-color 'bg-alt2)))

  (defun nox/sideline-remove-flymake-eldoc ()
    (setq-local eldoc-documentation-functions (remove #'flymake-eldoc-function eldoc-documentation-functions)))

#+end_src

