post-init.el

(use-package vertico
  :hook
  (on-first-input . vertico-mode)
  :custom
  (vertico-count 13)
  (vertico-resize t)
  (vertico-cycle t)
  :bind (:map vertico-map
              ("C-j"      . vertico-next)
              ("C-M-j"    . vertico-next-group)
              ("C-k"      . vertico-previous)
              ("C-M-k"    . vertico-previous-group)
              ("M-RET"    . vertico-exit-input)
              ("<escape>" . minibuffer-keyboard-quit))
  :config
  ;; Add » before the selected completion.
  (advice-add #'vertico--format-candidate :around
              (lambda (orig cand prefix suffix index _start)
                (setq cand (funcall orig cand prefix suffix index _start))
                (concat
                 (if (= vertico--index index)
                     (propertize "» " 'face 'vertico-current)
                   "  ")
                 cand))))

(use-package vertico-directory
  :after vertico
  :ensure nil
  ;; More convenient directory navigation commands
  :bind (:map vertico-map
              ("RET" . vertico-directory-enter)
	          ("DEL" . vertico-directory-delete-char))
  ;; Tidy shadowed file names
  :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))

(use-package vertico-multiform
  :ensure nil
  :hook (vertico-mode . vertico-multiform-mode)
  :config
  (defvar +vertico-transform-functions nil)

  (cl-defmethod vertico--format-candidate :around
    (cand prefix suffix index start &context ((not +vertico-transform-functions) null))
    (dolist (fun (ensure-list +vertico-transform-functions))
      (setq cand (funcall fun cand)))
    (cl-call-next-method cand prefix suffix index start))

  (defun +vertico-highlight-directory (file)
    "If FILE ends with a slash, highlight it as a directory."
    (when (string-suffix-p "/" file)
      (add-face-text-property 0 (length file) 'marginalia-file-priv-dir 'append file))
    file)

  (defun +vertico-highlight-enabled-mode (cmd)
    "If MODE is enabled, highlight it as font-lock-constant-face."
    (let ((sym (intern cmd)))
      (with-current-buffer (nth 1 (buffer-list))
        (if (or (eq sym major-mode)
                (and
                 (memq sym minor-mode-list)
                 (boundp sym)
                 (symbol-value sym)))
            (add-face-text-property 0 (length cmd) 'font-lock-constant-face 'append cmd)))
      cmd))

  (add-to-list 'vertico-multiform-categories
               '(file
                 (+vertico-transform-functions . +vertico-highlight-directory)))
  (add-to-list 'vertico-multiform-commands
               '(execute-extended-command
                 (+vertico-transform-functions . +vertico-highlight-enabled-mode))))

(use-package sops
  :hook
  (yaml-ts-mode . sops-mode)
  :bind
  (:map yaml-ts-mode-map
        ("C-c C-c" . sops-save-file)
        ("C-c C-k" . sops-cancel)
        ("C-c C-d" . sops-edit-file)))

(use-package corfu
  :hook
  (on-first-input . global-corfu-mode)
  (prog-mode . corfu-mode)
  (shell-mode . corfu-mode)
  (eshell-mode . corfu-mode)
  :custom
  (corfu-cycle t)                     ;; Enable cycling for `corfu-next/previous'
  (corfu-auto t)                      ;; Enable auto completion
  (corfu-auto-prefix 2)               ;; Enable auto completion
  (corfu-auto-delay 0.24)             ;; Enable auto completion
  (corfu-preview-current 'insert)     ;; Disable current candidate preview
  (corfu-on-exact-match nil)          ;; Configure handling of exact matches
  (corfu-scroll-margin 5)             ;; Use scroll margin
  (corfu-quit-at-boundary 'separator) ;; Quit completion unless seperator
  :bind
  (:map corfu-map
        ("M-SPC" . corfu-insert-separator))
  :config
  (set-face-attribute 'corfu-default nil :inherit 'fixed-pitch)
  (nox/set-corfu-colors)
  (add-hook 'evil-insert-state-exit-hook #'corfu-quit))

(defun nox/set-corfu-colors ()
  (when (featurep 'corfu)
    (set-face-attribute 'corfu-current nil :background (doom-color 'bg-alt))))

(add-hook! nox/after-theme-change #'nox/set-corfu-colors)

(use-package nerd-icons-corfu
  :after corfu
  :config
  (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

(use-package corfu-history
  :after (corfu savehist)
  :ensure nil
  :hook
  (corfu-mode . corfu-history-mode)
  :config
  (add-to-list 'savehist-additional-variables 'corfu-history))

(use-package corfu-popupinfo
  :ensure nil
  :hook (corfu-mode . corfu-popupinfo-mode)
  :custom
  (corfu-popupinfo-delay '(0.2 . 0.5)))

(use-package emacs
  :ensure nil
  :custom
  (tab-always-indent 'complete)
  ;; Emacs 30 and newer: Disable Ispell completion function. As an alternative,
  ;; try `cape-dict'.
  (text-mode-ispell-word-completion nil)

  ;; Hide commands in M-x which do not apply to the current mode.  Corfu
  ;; commands are hidden, since they are not used via M-x. This setting is
  ;; useful beyond Corfu.
  (read-extended-command-predicate #'command-completion-default-include-p))

(use-package cape
  :commands (cape-dabbrev cape-file cape-elisp-block)
  :bind ("C-c p" . cape-prefix-map)
  :init
  (add-hook 'completion-at-point-functions #'cape-dabbrev)      ;; word completion from buffer
  (add-hook 'completion-at-point-functions #'cape-file)         ;; file name completion
  (add-hook 'completion-at-point-functions #'cape-keyword))

(use-package eglot
  :ensure nil
  :hook
  (prog-mode . eglot-ensure)
  :commands
  (eglot-ensure
   eglot-rename
   eglot-format-buffer)
  :bind
  ([remap eldoc-doc-buffer] . eldoc-box-help-at-point)
  :config
  (add-to-list
   'eglot-server-programs
   '(python-ts-mode . ("rass" "python")))

  ;; ensure rass is installed
  (nox/mason-ensure '("rass"))

  (set-face-attribute 'eglot-inlay-hint-face nil
                      :inherit 'font-lock-comment-face
                      :italic t))

(nox/mason-ensure 'python-ts-mode '("ruff" "ty"))

(use-package markdown-mode :defer t)

(use-package eldoc-box :commands eldoc-box-help-at-point)

(use-package sideline-flymake
  :hook
  (flymake-mode . sideline-mode)
  (sideline-mode . nox/sideline-remove-flymake-eldoc)
  :custom
  (sideline-flymake-display-mode 'line)
  (sideline-backends-right '(sideline-flymake)))

(defun nox/sideline-remove-flymake-eldoc ()
  (setq-local eldoc-documentation-functions (remove #'flymake-eldoc-function eldoc-documentation-functions)))
