post-init.el

(use-package yasnippet
  :hook
  (on-first-file . yas-global-mode)
  (eglot--managed-mode . nox/update-capf-eglot))

(use-package snippy
  :ensure (:host github :repo "MiniApollo/snippy" :branch "main" :rev :newest)
  :hook (yas-global-mode . global-snippy-minor-mode)
  :custom
  (snippy-global-languages '("global"))
  :config
  (snippy-install-or-update-snippets)
  (add-hook 'completion-at-point-functions #'snippy-capf))

(use-package yasnippet-capf
  :after cape
  :config
  (add-hook 'completion-at-point-functions #'yasnippet-capf))

(defun cape-eglot-yasnippet ()
  (cape-wrap-super #'eglot-completion-at-point #'yasnippet-capf #'snippy-capf))

(defun nox/update-capf-eglot ()
  "Adds snippets completion to eglot."
  (remove-hook! 'completion-at-point-functions :local #'eglot-completion-at-point)
  (add-hook! 'completion-at-point-functions :local #'cape-eglot-yasnippet))

(use-package apheleia
  :commands apheleia-mode
  :hook (prog-mode . apheleia-mode)
  :config
  (setf (alist-get 'python-ts-mode apheleia-mode-alist)
        '(ruff-isort ruff))
  (setf (alist-get 'python-mode apheleia-mode-alist)
        '(ruff-isort ruff)))

(use-package diff-hl
  :hook
  (on-first-file . global-diff-hl-mode)
  (on-first-file . diff-hl-flydiff-mode)
  (magit-post-refresh . diff-hl-magit-post-refresh)
  :custom
  (diff-hl-show-staged-changes nil)
  (diff-hl-ask-before-revert-hunk nil))

(defun nox/set-diff-hl-faces ()
  (when (featurep 'diff-hl)
    (set-face-attribute 'diff-hl-change nil
                        :foreground (doom-color 'yellow)
                        :background 'unspecified)

    (set-face-attribute 'diff-hl-insert nil
                        :foreground (doom-color 'green)
                        :background 'unspecified)

    (set-face-attribute 'diff-hl-delete nil
                        :foreground (doom-color 'red)
                        :background 'unspecified)))

(add-hook! (nox/after-theme-change on-first-file) #'nox/set-diff-hl-faces)

(use-package transient)
(use-package magit
  :hook
  (git-commit-mode . (lambda () (mixed-pitch-mode -1)))
  (git-commit-mode . evil-insert-state)
  :commands magit
  :custom
  (magit-format-file-function #'magit-format-file-nerd-icons))

(use-package consult-gh
  :commands (consult-gh-repo-create consult-gh-repo-delete)
  :hook
  (consult-gh-repo-post-clone . projectile-discover-projects-in-directory)
  :custom
  (consult-gh-default-clone-directory nox/projects-directory)
  (consult-gh-show-preview t)
  (consult-gh-preview-key "C-o")
  (consult-gh-repo-action #'consult-gh--repo-browse-files-action)
  (consult-gh-large-file-warning-threshold 2500000)
  (consult-gh-confirm-name-before-fork nil)
  (consult-gh-confirm-before-clone t)
  (consult-gh-notifications-show-unread-only nil)
  (consult-gh-default-interactive-command #'consult-gh-transient)
  (consult-gh-prioritize-local-folder 'nil)
  (consult-gh-group-dashboard-by :reason)
  ;;;; Optional
  (consult-gh-repo-preview-major-mode nil) ; show readmes in their original format
  (consult-gh-preview-major-mode 'org-mode) ; use 'org-mode for editing comments, commit messages, ...
  :config
  ;; Remember visited orgs and repos across sessions
  (add-to-list 'savehist-additional-variables 'consult-gh--known-orgs-list)
  (add-to-list 'savehist-additional-variables 'consult-gh--known-repos-list)
  ;; Enable default keybindings (e.g. for commenting on issues, prs, ...)
  (consult-gh-enable-default-keybindings))

(use-package ligature
  :hook (on-first-input . global-ligature-mode)
  :config
  ;; Enable the "www" ligature in every possible major mode
  (ligature-set-ligatures 't '("www"))
  ;; Enable traditional ligature support in eww-mode, if the
  ;; `variable-pitch' face supports it
  (ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
  ;; Enable all Cascadia Code ligatures in programming modes
  (ligature-set-ligatures '(prog-mode org-mode)
                          '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
                            ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
                            "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
                            "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
                            "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@"
                            "~=" "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "=>" "!="
                            "!!" ">:" "\\\\" "://" "..<" "</>" "###" "#_(" "<<<" "<+>"
                            ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
                            "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
                            "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
                            "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
                            "<--" "<-<" "<<=" "<<-")))
