config.org
** Project Management
#+begin_src emacs-lisp

  (use-package projectile
    :commands (+switch-or-make-project)
    :hook
    (on-init-ui . projectile-mode)
    :custom
    (projectile-project-search-path (list nox/projects-directory)))

  (use-package consult-projectile
    :after (:all projectile consult))

#+end_src

#+begin_src emacs-lisp

  (defun nox/create-git-repo (project-name)
    "Create a new Git repository under `nox/projects-directory` named PROJECT-NAME.
          If the directory already exists, signal a user error."
    (interactive "sProject name: ")
    (let* ((root   (file-name-as-directory
                    (expand-file-name nox/projects-directory)))
           (target (expand-file-name project-name root)))
      (when (file-exists-p target)
        (user-error "Directory %S already exists" target))
      ;; Create the directory tree
      (make-directory target t)
      ;; Run git init
      (let ((default-directory target))
        (unless (= 0 (call-process "git" nil "*git-init*" t "init"))
          (delete-directory target t)
          (error "git init failed; removed %S" target)))
      (message "Initialized empty Git repository in %S" target)))

  (defun nox/create-projectile-project (project-name)
    "Create a new Projectile project under `nox/projects-directory`.
        Makes a fresh directory named PROJECT-NAME and an empty `.projectile` file in it."
    (interactive "sProject name: ")
    (let* ((root   (file-name-as-directory
                    (expand-file-name nox/projects-directory)))
           (target (expand-file-name project-name root)))
      (when (file-exists-p target)
        (user-error "Directory %S already exists" target))
      ;; create directory tree
      (make-directory target t)
      ;; create an empty .projectile file
      (let ((proj-file (expand-file-name ".projectile" target)))
        (with-temp-file proj-file
          ;; insert default ignores or whatever you like, e.g.:
          ;; (insert "# Add patterns to include/ignore in this project\n")
          ))
      (message "Created Projectile project in %S" target)))

  (defun nox/create-project (project-name)
    "Interactively create a new project called PROJECT-NAME."
    (interactive "sProject name: ")
    (require 'consult)
    (let* ((choices (list
                     (cons "Create a new git repo on Github" :remote)
                     (cons "Create a new git repo locally" :local)
                     (cons "Create only a project dir" :project)))
           (prompt   "What would you like to do? ")
           (answer   (consult--read choices
                                    :prompt prompt
                                    :lookup #'consult--lookup-cdr
                                    :sort nil)))
      (pcase answer
        (:remote  (consult-gh-repo-create project-name))
        (:local   (nox/create-git-repo project-name))
        (:project (nox/create-projectile-project project-name)))))

  (defun +switch-or-make-project (&optional arg)
    "Switch to a project from known projects, or create a new one with `consult-gh-repo-create`."
    (interactive "P")
    (let ((projects (projectile-relevant-known-projects)))
      (if projects
          (projectile-completing-read
           "Switch to project: " projects
           :action (lambda (project)
                     (if (member project projects)
                         ;; Existing project → switch to it
                         (projectile-switch-project-by-name project arg)
                       ;; New project → create new project and switch to it
                       (progn
                         (nox/create-project project)
                         (projectile-discover-projects-in-search-path)
                         (projectile-switch-project-by-name project arg)))))
        (user-error "There are no known projects"))))

#+end_src

** Rainbow Delimeters, Prettified Hex Codes & Todos
#+begin_src emacs-lisp

  (use-package rainbow-delimiters
    :hook
    (prog-mode . rainbow-delimiters-mode)
    :config
    (setq rainbow-delimiters-max-face-count 5))

  (use-package rainbow-mode
    :hook
    (help-mode . rainbow-mode)
    (prog-mode . rainbow-mode))

  (use-package hl-todo
    :hook (prog-mode. hl-todo-mode))

#+end_src

** Syntax Highlighting
Tree-sitter in Emacs is an incremental parsing system introduced in Emacs 29 that provides precise, high-performance syntax highlighting.
#+begin_src emacs-lisp

  (use-package treesit-auto
    :custom
    (treesit-auto-install 'prompt)
    :hook (on-first-input . global-treesit-auto-mode)
    :config
    (treesit-auto-add-to-auto-mode-alist 'all))

#+end_src

** Indentation
This whole section is taken from [[https://github.com/MatthewZMD/.emacs.d?tab=readme-ov-file#indentation][MatthewZMD/.emacs.d]].
[[https://github.com/jdtsmith/indent-bars][Indent Bars]] is a customizable indentation guide that provides fast and efficient visual cues for code structure in Emacs.
#+begin_src emacs-lisp

  (use-package indent-bars
    :custom
    (indent-bars-treesit-support t)
    (indent-bars-no-descend-string t)
    (indent-bars-treesit-ignore-blank-lines-types '("module"))
    (indent-bars-treesit-wrap '((python argument_list parameters
                                        list list_comprehension
                                        dictionary dictionary_comprehension
                                        parenthesized_expression subscript)))
    :hook ((eglot-managed-mode yaml-mode) . indent-bars-mode))

#+end_src

This section also covers indentation configuration for optimal coding experiences.
#+begin_src emacs-lisp

  (setq-default indent-tabs-mode nil)
  (setq-default indent-line-function 'insert-tab)
  (setq-default tab-width 4)
  (setq-default c-basic-offset 4)
  (setq-default js-switch-indent-offset 4)
  (c-set-offset 'comment-intro 0)
  (c-set-offset 'innamespace 0)
  (c-set-offset 'case-label '+)
  (c-set-offset 'access-label 0)
  (c-set-offset (quote cpp-macro) 0 nil)
  (defun smart-electric-indent-mode ()
    "Disable 'electric-indent-mode in certain buffers and enable otherwise."
    (cond ((and (eq electric-indent-mode t)
                (member major-mode '(erc-mode text-mode)))
           (electric-indent-mode 0))
          ((eq electric-indent-mode nil) (electric-indent-mode 1))))
  (add-hook 'post-command-hook #'smart-electric-indent-mode)

#+end_src

** Languages
*** Systemd
#+begin_src emacs-lisp

  (use-package systemd)

#+end_src

*** Python
#+begin_src emacs-lisp

  (use-package python-mode
    :ensure nil
    :mode "\\.py\\'"
    :config
    (add-to-list
     'eglot-server-programs
     '(python-ts-mode . ("rass" "python")))

    (nox/mason-ensure 'python-ts-mode '("ruff" "ty"))
    :custom
    (python-indent-offset 4)
    (python-shell-interpreter "python3"))

#+end_src

* Shells & Terminals
** Eshell
#+begin_src emacs-lisp

  (use-package eshell
    :commands eshell
    :ensure nil
    :config
    (setq eshell-rc-script    (expand-file-name "eshell/profile" nox/emacs-directory)
          eshell-aliases-file (expand-file-name "eshell/aliases" nox/emacs-directory)
          eshell-history-size 5000
          eshell-buffer-maximum-lines 5000
          eshell-hist-ignoredups t
          eshell-scroll-to-bottom-on-input t
          eshell-destroy-buffer-when-process-dies t
          eshell-visual-commands'("bash" "fish" "htop" "ssh" "top" "zsh"))

    (add-hook! eshell-mode  #'hide-mode-line-mode))

#+end_src

#+begin_src eshell-alias :tangle eshell/aliases :mkdirp yes

  alias cls clear 1
  alias e 'find-file $1'

#+end_src

** Vterm
#+begin_src emacs-lisp

  (use-package vterm
    :commands vterm
    :bind
    (:map vterm-mode-map
          ("C-\\" . window-toggle-side-windows))
    :custom
    (vterm-shell "/usr/bin/zsh")
    :hook
    (vterm-mode . hide-mode-line-mode)
    (vterm-mode . (lambda () (display-line-numbers-mode -1)))
    (vterm-mode . (lambda () (hl-line-mode -1))))

#+end_src


* Undo
** Undo Fu
[[https://github.com/emacsmirror/undo-fu][Undo Fu]] is a light weight wrapper for Emacs built-in undo system, adding convenient undo/redo without losing access to the full undo history, allowing you to visit all previous states of the document if you need. Here we also increase the default undo limit from =0.15mb= to the following mentioned values.
#+begin_src emacs-lisp

  (use-package undo-fu
    :after evil
    :commands (undo-fu-only-undo
               undo-fu-only-redo
               undo-fu-only-redo-all
               undo-fu-disable-checkpoint)
    :config
    (setq undo-limit 67108864)          ; 64mb.
    (setq undo-strong-limit 100663296)  ; 96mb.
    (setq undo-outer-limit 1006632960)) ; 960mb.

#+end_src

We also use [[https://codeberg.org/ideasman42/emacs-undo-fu-session][undo fu session]] to persist the undo/redo history through emacs sessions. This means the undo history won't be lost when restarting emacs.
#+begin_src emacs-lisp

  (use-package undo-fu-session
    :hook (elpaca-after-init . undo-fu-session-global-mode)
    :config
    (setq undo-fu-session-incompatible-files
          '("/COMMIT_EDITMSG\\'" "/git-rebase-todo\\'")))

#+end_src

