post-init.el

(use-package projectile
  :commands (+switch-or-make-project)
  :hook
  (on-init-ui . projectile-mode)
  :custom
  (projectile-project-search-path (list nox/projects-directory)))

(defun nox/create-git-repo (project-name)
  "Create a new Git repository under `nox/projects-directory` named PROJECT-NAME.
        If the directory already exists, signal a user error."
  (interactive "sProject name: ")
  (let* ((root   (file-name-as-directory
                  (expand-file-name nox/projects-directory)))
         (target (expand-file-name project-name root)))
    (when (file-exists-p target)
      (user-error "Directory %S already exists" target))
    ;; Create the directory tree
    (make-directory target t)
    ;; Run git init
    (let ((default-directory target))
      (unless (= 0 (call-process "git" nil "*git-init*" t "init"))
        (delete-directory target t)
        (error "git init failed; removed %S" target)))
    (message "Initialized empty Git repository in %S" target)))

(defun nox/create-projectile-project (project-name)
  "Create a new Projectile project under `nox/projects-directory`.
      Makes a fresh directory named PROJECT-NAME and an empty `.projectile` file in it."
  (interactive "sProject name: ")
  (let* ((root   (file-name-as-directory
                  (expand-file-name nox/projects-directory)))
         (target (expand-file-name project-name root)))
    (when (file-exists-p target)
      (user-error "Directory %S already exists" target))
    ;; create directory tree
    (make-directory target t)
    ;; create an empty .projectile file
    (let ((proj-file (expand-file-name ".projectile" target)))
      (with-temp-file proj-file
        ;; insert default ignores or whatever you like, e.g.:
        ;; (insert "# Add patterns to include/ignore in this project\n")
        ))
    (message "Created Projectile project in %S" target)))

(defun nox/create-project (project-name)
  "Interactively create a new project called PROJECT-NAME."
  (interactive "sProject name: ")
  (require 'consult)
  (let* ((choices (list
                   (cons "Create a new git repo on Github" :remote)
                   (cons "Create a new git repo locally" :local)
                   (cons "Create only a project dir" :project)))
         (prompt   "What would you like to do? ")
         (answer   (consult--read choices
                                  :prompt prompt
                                  :lookup #'consult--lookup-cdr
                                  :sort nil)))
    (pcase answer
      (:remote  (consult-gh-repo-create project-name))
      (:local   (nox/create-git-repo project-name))
      (:project (nox/create-projectile-project project-name)))))

(defun +switch-or-make-project (&optional arg)
  "Switch to a project from known projects, or create a new one with `consult-gh-repo-create`."
  (interactive "P")
  (let ((projects (projectile-relevant-known-projects)))
    (if projects
        (projectile-completing-read
         "Switch to project: " projects
         :action (lambda (project)
                   (if (member project projects)
                       ;; Existing project → switch to it
                       (projectile-switch-project-by-name project arg)
                     ;; New project → create new project and switch to it
                     (progn
                       (nox/create-project project)
                       (projectile-discover-projects-in-search-path)
                       (projectile-switch-project-by-name project arg)))))
      (user-error "There are no known projects"))))

(use-package rainbow-delimiters
  :hook
  (prog-mode . rainbow-delimiters-mode)
  :config
  (setq rainbow-delimiters-max-face-count 5))

(use-package rainbow-mode
  :hook
  (help-mode . rainbow-mode)
  (prog-mode . rainbow-mode))

(use-package hl-todo
  :hook (prog-mode. hl-todo-mode))

(use-package treesit-auto
  :custom
  (treesit-auto-install 'prompt)
  :hook (on-first-input . global-treesit-auto-mode)
  :config
  (treesit-auto-add-to-auto-mode-alist 'all))

(use-package indent-bars
  :custom
  (indent-bars-treesit-support t)
  (indent-bars-no-descend-string t)
  (indent-bars-treesit-ignore-blank-lines-types '("module"))
  (indent-bars-treesit-wrap '((python argument_list parameters
                                      list list_comprehension
                                      dictionary dictionary_comprehension
                                      parenthesized_expression subscript)))
  :hook ((eglot--managed-mode yaml-mode) . indent-bars-mode))

(setq-default indent-tabs-mode nil)
(setq-default indent-line-function 'insert-tab)
(setq-default tab-width 4)
(setq-default c-basic-offset 4)
(setq-default js-switch-indent-offset 4)
(c-set-offset 'comment-intro 0)
(c-set-offset 'innamespace 0)
(c-set-offset 'case-label '+)
(c-set-offset 'access-label 0)
(c-set-offset (quote cpp-macro) 0 nil)
(defun smart-electric-indent-mode ()
  "Disable 'electric-indent-mode in certain buffers and enable otherwise."
  (cond ((and (eq electric-indent-mode t)
              (member major-mode '(erc-mode text-mode)))
         (electric-indent-mode 0))
        ((eq electric-indent-mode nil) (electric-indent-mode 1))))
(add-hook 'post-command-hook #'smart-electric-indent-mode)

(use-package eshell
  :commands eshell
  :ensure nil
  :config
  (setq eshell-rc-script    (expand-file-name "eshell/profile" nox/emacs-directory)
        eshell-aliases-file (expand-file-name "eshell/aliases" nox/emacs-directory)
        eshell-history-size 5000
        eshell-buffer-maximum-lines 5000
        eshell-hist-ignoredups t
        eshell-scroll-to-bottom-on-input t
        eshell-destroy-buffer-when-process-dies t
        eshell-visual-commands'("bash" "fish" "htop" "ssh" "top" "zsh"))

  (add-hook! eshell-mode  #'hide-mode-line-mode))

(use-package vterm
  :commands vterm
  :bind
  (:map vterm-mode-map
        ("C-\\" . window-toggle-side-windows))
  :custom
  (vterm-shell "/usr/bin/zsh")
  :hook
  (vterm-mode . hide-mode-line-mode)
  (vterm-mode . (lambda () (display-line-numbers-mode -1)))
  (vterm-mode . (lambda () (hl-line-mode -1))))

(use-package undo-fu
  :after evil
  :commands (undo-fu-only-undo
             undo-fu-only-redo
             undo-fu-only-redo-all
             undo-fu-disable-checkpoint)
  :config
  (setq undo-limit 67108864)          ; 64mb.
  (setq undo-strong-limit 100663296)  ; 96mb.
  (setq undo-outer-limit 1006632960)) ; 960mb.

(use-package undo-fu-session
  :hook (elpaca-after-init . undo-fu-session-global-mode)
  :config
  (setq undo-fu-session-incompatible-files
        '("/COMMIT_EDITMSG\\'" "/git-rebase-todo\\'")))
