config.org
** Vundo
Alongside [[#undo-fu][undo fu]] we also use [[https://github.com/casouri/vundo][vundo]] to show the undo history in a tree graph. This makes moving around the undo history super easy. Here we improve the default vundo to use unicode symbols, better colors as well as a easy keybind to get inside vundo.
#+begin_src emacs-lisp

  (use-package vundo
    :commands vundo
    :custom
    (vundo-glyph-alist vundo-unicode-symbols)
    (vundo-compact-display t))

#+end_src

* Benchmarking
#+begin_src emacs-lisp

  (let ((init-time (float-time (time-subtract (current-time) init-start-time)))
        (total-time (string-to-number (emacs-init-time "%f"))))
    (message (concat
      (propertize "Startup time: " 'face 'bold)
      (format "%.2fs " init-time)
      (propertize (format "(+ %.2fs system time)"
                          (- total-time init-time)) 'face 'shadow))))

#+end_src
